'''
Set : 집합 순서 없고, 중복 없는 목록 {     } 사용
- 중복 제거할 때 (태그, 접속 유저)
- 두 목록 비교할 때 (맞팔, 공통구매)
- 포함여부 빠르게 확인 (리스트보다 훨씬 빠름)
'''
def Set집합기초():
    태그목록 = {"휴양지", "바다", "ootd", "나들이", "daily", "일상", "휴양지"}
    print(태그목록)  # {'휴양지', 'daily', 'ootd', '나들이', '바다', '일상'}

    A유저_구매목록 = {"아이폰", "맥북", "에어팟"}
    B유저_구매목록 = {"아이폰", "갤럭시", "버즈"}

    # 합집합 | 둘 다 합치기
    print(A유저_구매목록 | B유저_구매목록)
    # {'갤럭시', '맥북', '아이폰', '에어팟', '버즈'}
    # 둘 다 아이폰은 가지고 있으므로 한 번 만 보여주기~

    # 교집합 & 둘 다 가진 것
    print(A유저_구매목록 & B유저_구매목록)
    # {'아이폰'}

    # 차집합 - A  만 가진 것
    print(A유저_구매목록 - B유저_구매목록)
    # {'맥북', '에어팟'}


def 팔로워팔로우찾기():
    내팔로워 = {"유저A","유저B","유저C"}
    내팔로잉 = {"유저A","유저D","유저C"}
    맞팔 = 내팔로워 & 내팔로잉
    print("나와 맞팔인 사람 : ",맞팔)                               #    {'유저A', '유저C'}

    # 내가 팔로우하는데 상대방이 안하는 사람 (내가 언팔할 대상!!!)
    언팔로우_할_사람들 = 내팔로잉 - 내팔로워
    print("언팔로우 할 사람들 :",언팔로우_할_사람들)                #   {'유저D'}

    # 상대방은 나를 팔로우하지만 나는 하지 않는 사람 (고마운 유저~)
    나를팔로우하는사람들 = 내팔로워 - 내팔로잉
    print("나를 팔로우 하는 고마운 사람들 : ",나를팔로우하는사람들) #   {'유저B'}


팔로워팔로우찾기()





