def 주문하기(*메뉴들):
    print(메뉴들, "주문완료")
# 주문하기("치킨")
# 주문하기("치킨", "피자", "콜라")

# for = 처음부터 끝까지 반복하겠다
# in  = 반복할 목록들
# for ~ in  목록들   = ~ 에는 목록으로 가져온 데이터를 하나씩 꺼내서
# for 안에 있는 코드들을 수행한다.
# i = index 의 줄임말 -> 공식설명문 i 라는 표기를 사용
def 채팅방만들기(*참여자들):
    for i in 참여자들:
        if i == "철수":
            print(f"{i}님이 입장했습니다.")

채팅방만들기("철수", "영희", "민준")

def 장바구니담기(*상품들):
    총개수 = len(상품들)
    print(f"총 {총개수}개 상품이 장바구니에 담겼습니다.")
# 장바구니담기("노트북", "마우스", "키보드")

def 더치페이(총금액, *참여자들):
    인당 = 총금액 // len(참여자들)
    for 참여자 in 참여자들:
        print(f"{참여자} : {인당}원")


# 더치페이(30000, "철수", "영희", "민준")
def 검색기록저장(*검색어들):
    for 번호, 검색어 in enumerate(검색어들,1):
        print(f"{번호}. {검색어}")


검색기록저장("파이썬", "AI", "챗GPT")
