def 회원가입(**회원정보):
    for 키, 값 in 회원정보.items():
        print(키, 값)


# 회원가입(이름="철수", 나이=20, 지역="서울")


def 상품목록(**상품정보):
    for 키, 값 in 상품정보.items():
        print(키, 값)


# 상품목록(상품명="노트북", 가격=1200000, 재고=5)

def 광고만들기(캠페인이름, **옵션):
    print("캠페인:", 캠페인이름)
    for 키, 값 in 옵션.items():
        print(키, 값)
광고만들기("여름세일", 예산=500000, 지역="서울", 나이="20-35")

def 송금(**송금정보):
    for 키, 값 in 송금정보.items():
        print(키,값)

송금(보내는사람="철수", 받는사람="영희", 금액=30000, 메모="생일선물")


def 호텔예약(호텔이름, **예약정보):
    print("호텔:", 호텔이름)
    for 키, 값 in 예약정보.items():
        print(키,값)


호텔예약("롯데호텔", 체크인="2025-05-01", 체크아웃="2025-05-03", 인원=2)
