'''
lambda = 수학/논리학
함수를 표현하는 수학적 표기법 을 만들었다.
入계산법(Lambda Calculus) 라고 부르게됨
入x. x* 2 = x를 받아서 x*2 를 돌려주는 함수(=기능)

알론조 처치의 入(lambda) 계산법 -> 1958 프로그래밍 도입
-> python, java, javaScript 등 대부분의 언어가 그대로 알론조 처치의 수학법 가져와서 프로그래밍으로 사용

수학자가 인쇄 문제로 그리스 문자 入 를  사용했고, 그것을 프로그래밍 언어에서 사용하는 것!
'''


def 두배(x):
    return x * 2


두배 = lambda x: x * 2

print(두배(5))  # → 10


def 세금붙이기(가격):
    return 가격 * 1.1


# lambda 로 바꾸기
세금붙이기 = lambda 가격: 가격 * 1.1

print(세금붙이기(10000))  # → 11000.0


def 풀네임(성, 이름):
    return 성 + 이름


# lambda 로 바꾸기
풀네임 =

print(풀네임("김", "철수"))  # → 김철수

뉴스 = [
    {"제목": "AI 혁신", "조회수": 82000},
    {"제목": "경제 동향", "조회수": 45000},
    {"제목": "스포츠", "조회수": 120000},
]

# lambda 로 조회수 기준 내림차순 정렬
# sorted 오름차순  sorted(reverse=True) -> 오름차순 거꾸로 뒤집어서 정렬하기 = 내림차순
결과 = sorted(뉴스, key=lambda x: ["조회수"], reverse=True)

for 기사 in 결과:
    print(기사["제목"], 기사["조회수"])

친구들 = [
    {"이름": "철수", "나이": 25},
    {"이름": "영희", "나이": 20},
    {"이름": "민준", "나이": 23},
]

# lambda 로 나이 기준 오름차순 정렬
결과 = sorted(친구들, key=)

for 친구 in 결과:
    print(친구["이름"], 친구["나이"])
