'''
파이썬 문자열 포멧팅 문법

숫자를 어떻게 보여줄지 모양을 지정하는 규칙

f"{값:형식}"
: 뒤에 오는 것이 형태 옵션
숫자, 정렬, 자리수 등 지정 가능
'''

숫자1 = 84.3333333333333
print(f"{숫자1:.2f}")  # 숫자1 데이터를 소수점 2번째 자리까지만 보여주겠다.
# 84.33
print(f"{3.14159:.1f}")  # 3.14159 데이터를 소수점 1번째 자리까지만 보여주겠다.
# 3.1
print(f"{3:.4f}")  # 3 데이터를 소수점 4번째 자리까지만 보여주겠다.
# 3.0000

# d = 정수
# 자리수를 맞출 때 주로 사용
숫자2 = 7
print(f"{숫자2:2d}")  # " 7"  2자리를 맞추긴 하지만 빈 자리는 띄어쓰기로 유지
print(f"{숫자2:02d}")  # "07"  2자리를 맞추되 없는 자리는 0으로 채운다.
print(f"{123:3d}")  # "123"  그대로 세자리 나온다.
print(f"{123:4d}")  # " 123" 없는자리는 띄어쓰기로 유지
print(f"{123:04d}")  # "0123" 없는자리는 0으로 채운다.
print(f"{1234:3d}")  # "1234" 만약 3자리 요청했는데 숫자가 넘치면 넘치는대로 보여준다.

# 000 단위를 ,로 구분
숫자3 = 10000000
print(f"{숫자3:,}")  # 10,000,000   000기준으로 , 생성되어 출력

이름 = "길동"
print(f"{이름:>5}")   # 5글자를 기준으로 하되 "   길동" 3칸의 공백이 앞에 생성된다.
print(f"{이름:>05}")  # 5글자를 기준으로 하되 "000길동" 3칸의   0이 앞에 생성된다.