"""
각 가정이 존재하고 가정에 따른 결과를 도달하기 위하여 만들어진 것

KNeighborsClassifier
- 주변을 보고 판단하는 모델
- 새로운 데이터가 들어오면 기존 데이터에서 가장 가까운 K개의 이웃을 찾아 다수결로 분류
- 사용 : 데이터가 적고 간단할 때 ,데이터 분포가 복잡해서 딱 떨어지는 경계선을 그리기 어려울 때 사용
- 단점 : 데이터가 많아지면 느려지고, 컬럼 수가 많으면 성능이 떨어짐

LinearRegression
- 점들을 가장 잘 설명하는 직선긋기
- 연속적인 숫자값을 예측할 때 사용
- 사용 : 집값, 매출, 온도 같이 숫자로 된 결과를 예측할 때 사용
- 단점 : 직선으로만 표현하기 때문에 복잡한 패턴은 잡지 못한다.
- 회귀에 대하여 공부할 때 처음만 거의 사용

Ridge
- Linear 기반으로 과적합 방지 기능이 추가된 버전
- 선형 회귀(=LinearRegression)와 동일하지만, 가중치가 너무 커지지 않도록 패널티 부여
- 모델이 훈련 데이터에만 지나치게 맞춰지는 과적합 막아준다.
- 사용 : 컬럼이 굉장히 많을 때, LinearRegression 썼는데 테스트 성능이 훈련 성능보다 많이 낮을 때(과적합 의심)
         여러 컬럼들이 서로 상관관계가 높을 때 사용

LogisticRegression
- 선형 회귀 결과에 시그모이드를 씌워서 분류한다.
- 선형 회귀로 나온 값을 시그모이드 함수로 0~1사이 확률로 변환하고 0.5 기준 분류
- 이름에는 회귀가 붙지만 실제로는 분류 알고리즘
- 합격 / 불합격 양성 음성 처럼 2가지로 결과가 나뉠 때 사용
- 단순히 분류만 한게 아니라 확률도 함께 보고싶을 때 해석하기 쉬운 분류 모델이 필요할 때 사용
- 데이터도 예측데이터가 아닌 분류 데이터로 주로 학습을 함
- 이름만 회귀이고 분류이다. 분류안에 회귀가 들어간...

결과가 숫자면 Linear / Ridge
결과가 분류면 KNN    / Logistic 먼저 접근

세상에는 정말 많은 모델이 있고 위 4가지는 공부를 위한 기초 모델



* 과적합(Overfitting)
 - 훈련 데이터만 너무 외워버린 상태
 - 시험 공부할 때 작년 기출문제 답을 모두 외운 학생
 - 기출문제는 100점인데 실제 시험에서는 50점을 맞았다.
 - 본질을 이해한 것이 아니라 그냥 외운 것이라 새로운 문제가 나오면 못 푸는 상태
 - 모델도 똑같이 훈련 데이터의 패턴을 너무 세밀하게 외워버리면 새로운 데이터(테스트)가 들어왔을 때 엉터리 예측
 - 훈련 정확도 : 99%  테스트 정확도 : 60% ← 과적합 의심

* 가중치 = 계수
- 수학/통계 계수(coefficient), 딥러닝/머신러닝에서는 가중치(weight) 로 불린다.
   sklearn 학습 후 model.coef_ 꺼낼 수 있다. coef 가 coefficient 줄임말
- 각 컬럼이 결과에 얼마나 영향을 주는지 나타내는 숫자
- 가중치가 클수록 그 컬럼이 결과에 큰 영향을미친다.
- 모델은 학습을 하며 가중치를 계속 조정해서 정답에 가까워 지려 한다.
- 훈련 데이터에 가중치가 너무 무의미하게 커지면 모델이 이상한 패턴까지 억지로 맞추려하여 가중치를 극단적 키움
  숫자가 조금만 바뀌어도 결과가 폭발적으로 달라지며, 훈련 데이터에는 맞지만 새 데이터에서는 완전히 틀림
  의미없어지는 모델이 된다.

* 패널티 부여
- 모델이 가중치를 적당한 크기로 유지하게 되고, 결과적으로 새로운 데이터에서도 안정적으로 동작하게 하기 위해 부여
- 너무 특정 데이터에 집착하지 말고, 전체적인 흐름 파악할 수 있도록 모델에 제약
  가충치 커졌어요? 이런상황은 계시죠? 이거 경고좀 드릴게요. 너무 클 필요는 없어요.
                                                                    와 같은 공식이 Ridge 내장되어 있다.
"""










