'''
데이터를 JSON 처럼 생긴 문서로 저장하는 데이터베이스

엑셀(=일반 DB, MySQL 같은 것)
이름    나이  도시
김개발   25   서울
이몽고   30   부산
행/열이 정해져 있고, 모든 행이 같은 구조여야 한다.

MongoDB
{"name" : "김개발", "age":25, "city":"서울", "hobbies":["코딩","독서"]}
{"name" : "이몽고", "age":30, "sns":{"instagram","@mongo"}}
각 문서가 자기만의 구조를 가질 수 있음, 필드가 달라도 됨
- 미리 테이블 구조를 만들지 않고, 데이터를 그때그때 넣으면된다.
- JSON 형태로 확장 저장 딕셔너리 / 객체 와 구조가 같아서 다루기 편함
- 데이터가 엄~청 많아져도 서버를 늘려서 버틸 수 있다. (구글 페이스북 같은 규모)
- 데이터 구조가 자주 바뀔 때
- SNS  피드, 상품 정보 처럼 항목마다 구조가 다를 때
- 데이터를 빠르게 읽어야 할 때 (데이터 저장보다 조회가 목적일 때)

반대로 회원가입 돈계산 같이 정확해야하는 곳에서는 사용하지 않는다.
nosql 유연함 우선 데이터 일단 저장 조회 빠르게 하자!
rdbms 데이터를 정확히 넣는 것 우선 / 빠른 것보다 제대로 제 자리에 데이터가 들어갔는가?
'''

'''
파이썬 환경 세팅
pip install pymongo

설치 확인 방법
pip show pymongo
이름과 버전이 나오면 성공
'''
from pymongo import  MongoClient
# 몽고 디비는 27017 포트에서 접속하고 데이터 갖고오기 가능
client = MongoClient("mongodb://localhost:27017/")

def 몽고디비_파이썬코드_연결확인():
    # 연결 확인
    print("Mongo DB 버전 : ", client.server_info()['version']) # Mongo DB 버전 :  7.0.32


db = client['mydb'] # 데이터베이스 선택
col = db['users']   # 컬렉션 선택 = 관계형 데이터 베이스 기준 Table 선택