'''
한국어 자연어 처리(NLP)
한국어 문장을 형태소 단위로 쪼개고, 품사를 태깅하고, 명사만 뽑아내는 등의 작업을 한다.

형태소 분석기
               속도          정확도                       특징
Okt            빠름           보통           가장 많이 사용 / SNS 텍스트에 강함
   -- Open Korean Text 트위터 코리아 개발자 출신 이수민
   -- Twitter Korean Text 에서 Okt 명칭 변경
   -- SNS 텍스트(줄임말, 신조어)에 강한 이유는 트위터 데이터로 훈련했기 때문
Komoran        보통           높음                  균형 잡힌 성능
Kkma           느림           높음                    상세한 분석
Hannaum        보통           보통                    KAIST 개발
Mecab        매우 빠름        높음                    별도 설치 필요
'''