'''
ElasticStack = 데이터 수집 -> 저장 -> 검색 -> 시각화 하는 오픈소스 플랫폼
기존 이름 ELK Stack 이었는데, Beats 추가되며 Elastic Stack 으로 이름 변경됨

탄생 배경
- 서버가 100대면 로그 파일이 100대이다. 어제 어떻게 다 볼 것인가?
- 로그를 한 곳에 모아서 검색하고 시각화하는 시스템을 만들자! 생성

주요 사용 사례
로그 모니터링 - 서버/앱 로그를 실시간으로 수집해서 에러 탐지. 가장 많이 사용하는 케이스
검색 서비스   - 쇼핑몰 상품 검색, 뉴스 검색, 문서 검색, ES만 써도 되는 케이스
보안 분석(SIEM) - 네트워크 이상 트래픽, 침입 탐지 등
인프라 모니터링 - CPU / 메모리 / 디스크 수집

구성요소
Beats         -> 데이터 수집(경량 에이전트)
Logstash      -> 데이터 가공(필터/변환 파이프라인)
Elasticsearch -> 저장 + 검색 (제일 중요한 엔진)
Kibana        -> 시각화(웹 대시보드)


ElasticStack 안에 Elasticsearch 라는 기능 들어있는 것
'''