"""
Apache Lucence 기반의 분산형 오픈소스 검색/분석 엔진
JSON 문서를 저장하고 거의 실시간으로 검색할 수 있다.

특징
분산    처리 = 데이터를 샤드(Shard)로 나눠 여러 노드에 분산 저장
RESTful API  = HTTP로 모든 작업(CRUD, 검색) 가능
Schema free  = JSON 문서를 그냥 넣어도 자동으로 매핑
전문   검색  = 형태소 분석, 역색인(InvertedIndex) 기반

주요 개념
개념              설명                   RDB 비유(관계형 데이터베이스 기준)
Index          문서의 집합                   Table
Document       저장 단위(JSON)               ROW
Field          문서의 속성                   Column
Shard          인덱스를 나눈 조각            Partition
Node           ES가 실행 중인 서버1대        Server
Cluster        Node 들의 집합                DB Server Group
"""

'''
개발을 처음할 때 모르는 단어들
Apache Lucence
- 텍스트에서 무언가를 빠르게 찾아주는 라이브러리
- 검색 기능을 만들 수 있게 해주는 도구 상자
- 만약 루씬이 없으면 어떻게 되는가?
   예를 들어 상품 100만 개 가 있고, 빨간 운동화  를 검색
   루씬 없이(단순 방법)
   상품   1번 설명 전체 읽고 -> 빨간 있는지 확인 -> 없음
   상품   2번 설명 전체 읽고 -> 빨간 있는지 확인 -> 없음
                     .........
   상품 100번 설명 전체 읽고 -> 빨간 있는지 확인 -> 없음
   
   루씬이 있으면
   빨간 찾기   [3번,7번,203번,....]
   운동화 찾기 [3번,15번,203번,....]
   교집합      [3번,203번]
   끝
   -> 전체를 안읽고 나눠진 표에서 바로 찾기기능
   
   루씬이 하는 일 5가지
   1. 분석 -- 집어넣기 전에 데이터 가공
        문장 : 나는 빠르게 달리는 강아지를 보았습니다
        
        1) 문장 쪼개기
            나는, 빠르게, 달리는, 강아지를, 보았습니다.
            
        2) 형태소 분석
            나, 빠르다, 달리다, 강아지, 보다
            (는, 게, 는, 를, 았습니다 분리)
            
        3) 의미없는 단어 제거
            빠르다, 달리다, 강아지, 보다
            (나 같은 단독 대명사는 검색 의미가 없으므로 반려)
            
        4) 최종 index에 저장
            빠르다, 달리다, 강아지, 보다
            
        5) 주요 키워드 단어를 저장 처리
        
    2. 색인(Indexing) - 역색인 테이블 만들기
        문서A : 강아지가 공원에서 빠르게 달린다.
        문서B : 고양이는 느리게 걷는다.
        문서C : 강아지와 고양이는 친구다.
        
        형태소 분석 후 역색인
        
         단어           어느 문서     문서 내 위치
        강아지            A, C           A:1번째, C:1번째
        공원              A              A:2번째
        빠르다            A              A:3번째
        달리다            A              A:4번째
        고양이            B, C           B:1번째, C:2번째
        느리다            B              B:2번째
        걷다              B              B:3번째
        친구              C              C:3번째
   
    3. 검     색(Searching) - 쿼리 처리
    4. 점수 계산(Scoring)   - 얼마나 관련있나
    4. 세그 먼트(Segment)   - 저장단위
    
    요약
    검색어 입력 -> 달리는 강아지 보았습니다.
    형태소 분석 -> [달리다, 강아지, 보다] 쪼개서 역색인 저장
    역색인 찾기 -> [강아지 달리기] 검색 => 강아지 + 달리다 역색인에서 바로 찾음
    점수   계산 -> 강아지 많이 나온 문서 위로 정렬
    결과   반환
    
    
나중에 달리는 강아지나 강아지가 달리다 검색하면
강아지 [A,C]   달리다 [A]   ===> 교집합  ===> 문서A 바로 찾는다.



오픈소스

분산  처리

샤드(Shard)

노드

RESTful API

CRUD


Schema


형태소

역색인(InvertedIndex)
'''