'''
Numerical Python
[] = 배열 = 리스트로 이루어진 데이터 연산 처리하는 라이브러리
파이썬에서 제공하는 기본 연산을 사용해도 되지만
수치 연산을 좀 더 빠르게 처리하기 위한 라이브러리
내부적으로 C언어로 구현되어 있고, 파이썬 리스트보다 수십 ~ 수백 배 빠르다.
데이터 분석, 머신러닝, 과학 계산의 기본이 된다.
'''
import numpy as np  # numpy 라는 이름이 너~무 길어서 np 명칭으로 축소해서 사용하겠다.
import time


def 넘파이기본개념확인():
    기본_파이썬_리스트 = [1, 2, 3]
    넘파이_파이썬_리스트 = np.array([1, 2, 3])  # 1,2,3 넘파이로 계산될 수 있도록 만들어진 리스트 = 배열이다.

    # 파이썬_리스트 : * 는 반복 이어붙이기 진행
    print("기본_파이썬_리스트 * 2 : ", 기본_파이썬_리스트 * 2)  # [1, 2, 3, 1, 2, 3]
    # NumPy 배  열 : 각 리스트 데이터에 2씩 곱함
    print("넘파이_파이썬_리스트 * 2 : ", 넘파이_파이썬_리스트 * 2)  # [2 4 6]


### 속도 비교 코드 ###

# 1000000 == 1_000_000
n = 1000000  # 참고로 파이썬은 1_000_000 를 이용해서 큰 숫자를 읽기 편하게 _로 자릿수 구분을 할 수 있다.
파이썬리스트 = list(range(n))  # 목록안에 0 부터 1_000_000 까지 [0,1,2,3,4,....] 만드는 방법
넘파이리스트 = np.arange(n)  # 위와 동일한 형태의 배열을 넘파이식으로 만들어낸 것


def 파이썬리스트속도():
    시작시간 = time.time()
    # 일반 for 문 방법
    # 결과_1 = []
    # for x in 파이썬리스트:
    #     결과_1.append(x * 2) # 결과_1 배열에 *2 가 된 데이터들을 모두 추가해서 사용하겠다.
    # 컴프리핸션 for 문 방법
    결과_2 = [x * 2 for x in 파이썬리스트]
    끝난시간 = time.time()
    print("파이썬리스트 : ", 결과_2)
    print(f"NumPy 배열 : {끝난시간 - 시작시간:.4f}초")  # 소수점 4자리까지만 허용


def 넘파이리스트속도():
    시작시간 = time.time()
    결과 = 넘파이리스트 * 2
    끝난시간 = time.time()
    print("넘파이리스트 : ", 결과)
    print(f"NumPy 배열 : {끝난시간 - 시작시간 :.4f}초")


파이썬리스트속도()
print("=" * 100)
넘파이리스트속도()
'''
위에서 각각 배열 = 리스트를 만들 때 나온 결과
결과시간은 매번 실행할 때마다 컴퓨터의 상황, 상태에 따라 다른 숫자값이 나올 수 있다.

파이썬리스트속도() = NumPy 배열 : 0.0517초
넘파이리스트속도() = NumPy 배열 : 0.0022초

파이썬리스트속도() = NumPy 배열 : 0.0492초
넘파이리스트속도() = NumPy 배열 : 0.0021초
'''
