'''
PanelData 약자
표(테이블) 형태의 데이터를 다루는 라이브러리
엑셀 시트처럼 행과 열로 이루어진 데이터를 파이썬에서 쉽게 다룰 수 있게 해줌

NumPy = 리스트 숫자 연산에 특화, 같은 타입만 가능
Pandas = 표 형태, 숫자/문자/날짜 섞어서 사용 가능
엑셀처럼 생긴 틀을 다루는 라이브러리

Series - 1차원 열 하나 데이터
DataFrame - n 차원 표 전체 데이터
 - 여러 개의 Series 가 모인 것
'''

import pandas as pd


def 판다스_Series_DataFrame():
    # Series - 1차원 (열 하나)
    s = pd.Series([10, 20, 30, 40])
    print(s)
    '''
    0    10
    1    20
    2    30
    3    40
    dtype: int64
    '''
    # 왼쪽이 인덱스, 오른쪽이 값

    # DataFrame - 2차원 (표 전체)
    df = pd.DataFrame({

        "이름": ["김철수", "이영희", "박민준"],
        "나이": [20, 30, 40],
        "점수": [88, 92, 100]
    })
    print(df)
    '''
        이름  나이   점수
    0  김철수  20   88
    1  이영희  30   92
    2  박민준  40  100
    '''

    # csv 파일에서 이름 컬럼에 있는 데이터좀 볼까??
    # csv파일데이터가_들어있는_변수공간["컬럼이름"]

    df["이름"]  # DataFrame 에서 열 하나만 꺼낸 상태 = DataFrame 에서 열 하나 꺼내면 -> Series
    # 열 하나씩 보여지는 것 또는 열 하나의 데이터만 존재하는 것  == Series
    # 다수의 Series 가 보여지는 것 다수의 열 데이터가 존재하는 것 == DataFrame


def 데이터전처리():
    # 전처리 = 데이터 전 부 처리 로 데이터를 분석하기 전에 깔끔하게 정리하는 작업
    # 1. 결측치 확인 - 비어있는 데이터
    데이터들 = pd.read_csv('한국언론진흥재단_뉴스빅데이터_메타데이터_여성_19991231.csv', encoding='cp949')
    비어있는_데이터 = 데이터들.isnull().sum()  # csv 에서 null = NaN = 빈 데이터를 각 컬럼별로 몇 개인지 더해라
    print("결측치 개수 확인 : ", 비어있는_데이터)
    '''
    결측치 개수 확인 :  일자        0
                        언론사       0
                        제목        0
                        통합 분류1    0
                        키워드       0
                        특성추출      0
                        dtype: int64
    위 데이터는 결측치가 없는 좋은 데이터

    '''
    # 행전체 중복 확인      = csv파일이 담겨진 변수 공간 명칭.duplicated().sum()
    # 특정 열에서 똑같은 것 = csv파일이 담겨진 변수 공간 명칭['컬럼이름'].duplicated().sum()
    중복개수확인 = 데이터들.duplicated().sum()  # 행 전체에서 모든 컬럼이 중복인 데이터의 총합
    print("중복 데이터 확인 : ", 중복개수확인)  # 중복 데이터 확인 :  214
    # 각 컬럼별로 중복인지 확인하고 싶다면 따로 작성
    중복개수확인_컬럼1번 = 데이터들["언론사"].duplicated().sum()  # csv에서 언론사 컬럼에서 중복 확인
    중복개수확인_컬럼2번 = 데이터들["제목"].duplicated().sum()  # csv에서 제목 컬럼에서 중복 확인

    중복제거 = 데이터들.drop_duplicates()  # 전체 줄 중복 제거

    # 필터링 - 원하는 데이터만 추출

    # == 완전히 똑같아야 한다.
    # str.contains 포함만 되어 있으면 된다.

    # 1번 - 완전히 일치하는 것만 조회
    # '국민일보' 와 똑같은 것만 추출  '국민일보 특별판' 이런건 안나옴
    국민일보_데이터 = 데이터들[데이터들['언론사'] == '국민일보']
    # 2번 - 포함된 것 찾기
    # 여성이라는 글자가 들어간 것 전부 추출
    # 여성 장관 등 모두 다 나옴
    특정제목_데이터 = 데이터들[데이터들['제목'].str.contains("여성")]
    # 3번 - 완전히 일치하는 것만 (1번과 같은 양식)
    # 사회-여성 완전히 똑같은 것만 추출
    특정분류_데이터 = 데이터들[데이터들['통합 분류1'] == '사회-여성']

    특정_열_삭제 = 데이터들.drop(columns=['특성추출'])
    특정_열_이름변경 = 데이터들.rename(columns={
        '통합 분류1': '분류'
    })

    컬럼내_데이터_개수확인 = 데이터들['언론사'].value_counts()
    print(f"중복개수확인_컬럼1번 : {중복개수확인_컬럼1번}")
    print(f"중복개수확인_컬럼2번 : {중복개수확인_컬럼2번}")
    print(f"국민일보_데이터 : {국민일보_데이터}")
    print(f"특정제목_데이터 : {특정제목_데이터}")
    print(f"특정분류_데이터 : {특정분류_데이터}")
    print(f"특정_열_삭제 : {특정_열_삭제}")
    print(f"특정_열_이름변경 : {특정_열_이름변경}")
    '''
    결측치 개수 확인 :  일자        0
    언론사       0
    제목        0
    통합 분류1    0
    키워드       0
    특성추출      0
    dtype: int64
    중복 데이터 확인 :  214
    중복개수확인_컬럼1번 : 39905
    중복개수확인_컬럼2번 : 2868
    국민일보_데이터 :                일자  ...                                               특성추출
    0      1999-01-01  ...  쿠바,카스트로,국민들,소련,주년,경제위기,중미,바오로,월평균,옐친,러시아,쿠바인들,...
    10     1999-01-01  ...  우간다,아프리카,김선교사,선교사,쿠미,우리나라,은예,중동부,구미시,경북,주민들,김순...
    11     1999-01-01  ...  하나님,정교수,홍원장,송회장,가정사역,노인들,그리스도,한국교회,가정예배,노인대학,경...
    57     1999-01-01  ...  오씨,하나로통신,오정희,면접관,우리나라,금융사,경영자,토끼띠,졸업반,이춘재,가구공장...
    61     1999-01-01  ...  한나라당,국민회의,의약분업,법사위,교원노조법안,교원단체법안,개정안,정부조직법,상임위...
    ...           ...  ...                                                ...
    39848  1999-12-31  ...  식물인간,미국,성탄절,의료진,뉴멕시코주,가족들,패티,16세,간병인,전남편,요양원,전...
    39880  1999-12-31  ...  여성들,정보화,이희호,창의력,한국,김진홍,동아,tv,金大中,김대중,이여사,교육수준,...
    39881  1999-12-31  ...  공무원시험,공무원,신체등급,장애인,점제,대기상태,지식적,의무병역,의무실,공백기,행정...
    39900  1999-12-31  ...  민주신당,서울,대구,청와대,비서관,광주,홍일점,공무원,사무총장,지도부,후보감,수도권...
    39902  1999-12-31  ...  미국,판매량,아메리칸,머큐리,소니,김의구,움직,1백만,9천,거미줄,음반사,닐슨,샤니...
    
    [1914 rows x 6 columns]
    특정제목_데이터 :                일자  ...                                               특성추출
    7      1999-01-01  ...  여성들,사회진출,김한철,경쟁력,정브,정보력,자율화,인격관계,자격사,남녀문제,김세무사...
    10     1999-01-01  ...  우간다,아프리카,김선교사,선교사,쿠미,우리나라,은예,중동부,구미시,경북,주민들,김순...
    13     1999-01-01  ...  송이버섯,일본,강동무역,1000만,금융기,백지혜,만큼,수출기간,현지경험,일본어,일본...
    16     1999-01-01  ...  동창회,여성회관,특강료,수강생,의쌀,건강체조,40kg,수익금,임도순,kg,8백,제과...
    18     1999-01-01  ...                 동창회,사진기사,의쌀,여성회관,사진,여성,회관,사랑,전달,기사
    ...           ...  ...                                                ...
    39909  1999-12-31  ...  손뜨개,동대문구,패션디자인,복지관,교육기간,서울,여성,모집,제과,디자인,수강,요리,...
    39920  1999-12-31  ...  화이트불,식물인간,26세,미국,후유증이,그새,40대,김태윤,김태윤기자,고무호스,요양...
    39922  1999-12-31  ...  여성들,이희호,창의력,정보화,이여사,한국,동아,tv,李姬鎬,우리나라,교육수준,신년메...
    39928  1999-12-31  ...  미국,이교수,nasa,물리학자,서울대,허블망원경,베네,과학자,사령관,스탠퍼드대,박사...
    39930  1999-12-31  ...  조정관,제천,대전유성,유응곤,박우건,이상덕,포항,북대구,중랑,위원회,도균,김재목,권...
    
    [7362 rows x 6 columns]
    특정분류_데이터 :                일자  ...                                               특성추출
    2      1999-01-01  ...  강원도,高玉子,특산품,협의회,여성들,앞장,회원들,건깅,주부들,만큼,필요한,관광지,도...
    6      1999-01-01  ...  つい,お년を,よい,ながい,2본의,なまけ,ぎる,어머,くだ,み과,도소,とお,でんしゃ,눈...
    7      1999-01-01  ...  여성들,사회진출,김한철,경쟁력,정브,정보력,자율화,인격관계,자격사,남녀문제,김세무사...
    10     1999-01-01  ...  우간다,아프리카,김선교사,선교사,쿠미,우리나라,은예,중동부,구미시,경북,주민들,김순...
    16     1999-01-01  ...  동창회,여성회관,특강료,수강생,의쌀,건강체조,40kg,수익금,임도순,kg,8백,제과...
    ...           ...  ...                                                ...
    39895  1999-12-31  ...  제대군인,군필자,가산점,헌법재판소,공직자,위헌결정,재판소,위헌판결,장애인,재향군인회...
    39901  1999-12-31  ...  문화부,박장관,공무원,청소년국,사무관,5급,국립중앙도서관,실무국장,서기관,여성공무원...
    39909  1999-12-31  ...  손뜨개,동대문구,패션디자인,복지관,교육기간,서울,여성,모집,제과,디자인,수강,요리,...
    39922  1999-12-31  ...  여성들,이희호,창의력,정보화,이여사,한국,동아,tv,李姬鎬,우리나라,교육수준,신년메...
    39930  1999-12-31  ...  조정관,제천,대전유성,유응곤,박우건,이상덕,포항,북대구,중랑,위원회,도균,김재목,권...
    
    [8793 rows x 6 columns]
    특정_열_삭제 :                일자  ...                                                키워드
    0      1999-01-01  ...  궁핍,일상,축하무드,실종,피델,카스트로,게바라,쿠바혁명,주년,유일,쿠바,신문,그란마...
    1      1999-01-01  ...  감동,영화,가족사랑,가족,자리,신정,연휴,방송사들,영화,방송,재탕,삼탕,예년,방송사...
    2      1999-01-01  ...  청정,특산품,홍보,앞장,청정,특산품,홍보,지원,앞장,여성,단체,속초,개최,관광,EX...
    3      1999-01-01  ...  송윤아,카멜레온,연기,박차,변신,명세빈,전문직,드라마,홍수,새해,연기자들,시청자,눈...
    4      1999-01-01  ...  외길인생,개척,외길,인생,개척,외길인생,두뇌자랑,己卯年,토끼이야기1999년,기묘년,...
    ...           ...  ...                                                ...
    39932  1999-12-31  ...  음란,퇴폐,영업,유흥,주점,누드쇼,윤락,행위,속칭,게이바,호스트바,음란,퇴폐,영업장...
    39933  1999-12-31  ...  대원,연말,취객,몸살,신고,모임,출동,분주연말연시,망년회,각종,거리,방황,취객들,1...
    39934  1999-12-31  ...  도약,발판,마련,프로젝트,국가예산,예산,확보,전북도,정결산전북,발전,전기,마련,지식...
    39935  1999-12-31  ...  실제성격,영화,배우,반대,배우,영화,여고괴담,번째,흥행,실패,실제,성공적,5명,배우...
    39936  1999-12-31  ...  사장님,한과,전문점,서정,문화,동네,번성,서양,제과점,맞대결,업종,한과전문점,부근,...
    
    [39937 rows x 5 columns]
    특정_열_이름변경 :                일자  ...                                               특성추출
    0      1999-01-01  ...  쿠바,카스트로,국민들,소련,주년,경제위기,중미,바오로,월평균,옐친,러시아,쿠바인들,...
    1      1999-01-01  ...  앨런,알렉스,아처,앨버트,크루거,중학교,여학생,뉴욕,프란체스카,래리,마이키,익스펙테...
    2      1999-01-01  ...  강원도,高玉子,특산품,협의회,여성들,앞장,회원들,건깅,주부들,만큼,필요한,관광지,도...
    3      1999-01-01  ...  명세빈,종이학,송윤아,전문직,연기자,연기자들,방송공사,차인표,상대역,김춘삼,방송사,...
    4      1999-01-01  ...  토끼띠,己卯年,외길인생,正東,五行,한계선,통행로,정서속,대인관계,거리감,안식처,교직...
    ...           ...  ...                                                ...
    39932  1999-12-31  ...  종업원,누드쇼,관계자,서귀포시,게이바,영업장,호스트바,아가씨들,제주시,송년회,관계당...
    39933  1999-12-31  ...  대원,전주소방서,취객들,소방서,분주연말연시,119구급,대원들,정작,완산소방서,성희롱...
    39934  1999-12-31  ...  전북,전주,새만금,전북도,중소기업,진입로,21세기,전주권공항,용담댐,1조,국가예산,...
    39935  1999-12-31  ...  박예진,이영진,효신,여고생,여고괴담,러브레터,시은,이시은,유니텔,아시아나항공,만큼,...
    39936  1999-12-31  ...  한과전문점,종로,10만,떡방,전문점,나대석,사람들,세검정,서울,한국,죽류,창립일,호...
    
    [39937 rows x 6 columns]

    '''

데이터전처리()
