'''
한국언론진흥재단_뉴스빅데이터_메타데이터_여성_19991231.csv 활용

컬럼 : 일자	언론사	제목	통합 분류1	키워드	특성추출
  ==> 컬럼이 하나가 아니다! 그 말은 DataFrame 이다
'''

import  pandas as pd
df = pd.read_csv('한국언론진흥재단_뉴스빅데이터_메타데이터_여성_19991231.csv', encoding='cp949')
print(df)
'''
               일자  ...                                               특성추출
0      1999-01-01  ...  쿠바,카스트로,국민들,소련,주년,경제위기,중미,바오로,월평균,옐친,러시아,쿠바인들,...
1      1999-01-01  ...  앨런,알렉스,아처,앨버트,크루거,중학교,여학생,뉴욕,프란체스카,래리,마이키,익스펙테...
2      1999-01-01  ...  강원도,高玉子,특산품,협의회,여성들,앞장,회원들,건깅,주부들,만큼,필요한,관광지,도...
3      1999-01-01  ...  명세빈,종이학,송윤아,전문직,연기자,연기자들,방송공사,차인표,상대역,김춘삼,방송사,...
4      1999-01-01  ...  토끼띠,己卯年,외길인생,正東,五行,한계선,통행로,정서속,대인관계,거리감,안식처,교직...
...           ...  ...                                                ...
39932  1999-12-31  ...  종업원,누드쇼,관계자,서귀포시,게이바,영업장,호스트바,아가씨들,제주시,송년회,관계당...
39933  1999-12-31  ...  대원,전주소방서,취객들,소방서,분주연말연시,119구급,대원들,정작,완산소방서,성희롱...
39934  1999-12-31  ...  전북,전주,새만금,전북도,중소기업,진입로,21세기,전주권공항,용담댐,1조,국가예산,...
39935  1999-12-31  ...  박예진,이영진,효신,여고생,여고괴담,러브레터,시은,이시은,유니텔,아시아나항공,만큼,...
39936  1999-12-31  ...  한과전문점,종로,10만,떡방,전문점,나대석,사람들,세검정,서울,한국,죽류,창립일,호...

[39937 rows x 6 columns]
'''

# 언론사 데이터 궁금하다 언론사 데이터 꺼내기
df['언론사']               # Series 형태의 데이터가 보여지는 것
print(df['언론사'])

# 컬럼을 하나가 아닌 두가지 이상을 가져와서 조회하고 싶다.
# csv파일이_담겨있는_데이터_공간의명칭[['컬럼1번','컬럼2번',...'']]
# 바깥 대괄호 = df[] 에 무언가를 담아두겠다.
# 안쪽 대괄호 = 가져올 데이터 컬럼들
# 데이터들조회 = ['컬럼1번', '컬럼2번']
# 각데이터확인 = [['컬럼1번', '컬럼2번']]

# df[['언론사','제목']] # DataFrame

print(df.shape)

# TODO 1 : 컬럼(열)이름 확인
print(df.columns)
# TODO 2 : 상위  5개 미리보기
print(df.head())
# TODO 3 : 상위 10개 미리보기
print(df.head(10))
# TODO 3 : 아래  5개 미리보기
print(df.tail())

# TODO 4 : 언론사 라는 열 하나 꺼내 조회
print(df['언론사'])

# TODO 5 : 일자 언론사 제목 데이터 꺼내 조회
print(df[['일자','언론사','제목']])
