'''
여행지ID	여행지명칭	지역구분	분류	태그	내용 유형	카피라이터	홈페이지	주소	여행지 경도
여행지 위도	여행지 특징	여행지 코스소개	여행지 누적 추천수	여행지 누적 관심수	여행지 등록일
여행지 찾아가는 길	여행지 연관 계절정보


'''
import pandas as pd

df = pd.read_csv("해양수산부_여행지_정보_20250709.csv")
# UnicodeDecodeError: 'cp949' codec can't decode byte 0xed in position 6: illegal multibyte sequence
# 공공데이터를 조회할 때 위와 같은 문제가 발생하면 cp949 가 아니라 utf-8 로 만들어진 것
# =============================================
# TODO 1
# 이 데이터가 몇 행 몇 열인지 출력하세요.
# 출력 결과 : (10319, 18)
# 힌트 : df.?????
# =============================================
print(df.shape)

# =============================================
# TODO 2
# 컬럼 이름 목록을 출력하세요.
# 힌트 : df.???????
# =============================================

print(df.columns)

# =============================================
# TODO 3
# 상위 5개 데이터를 출력하세요.
# 힌트 : df.????()
# =============================================
print(df.head())

# =============================================
# TODO 4
# 각 컬럼별 결측치(빈 데이터) 개수를 출력하세요.
# 힌트 : df.??????().???()
# =============================================
print(df.isnull().sum())

# =============================================
# TODO 5
# 중복된 행이 몇 개인지 출력하세요.
# 출력 결과 : 2
# 힌트 : df.??????????().???()
# =============================================
print(df.duplicated().sum())

# =============================================
# TODO 6
# 지역구분 컬럼에서 각 지역이 몇 개씩 있는지 출력하세요.
# 전남이 1723개로 가장 많이 나와야 합니다.
# 힌트 : df["지역구분"].???_??????()
# =============================================
print(df["지역구분"].value_counts())

# =============================================
# TODO 7
# 분류 컬럼에서 관광지인 것만 필터링해서 출력하세요.
# 완전히 일치하는 것만 추출합니다.
# 힌트 : df[df["분류"] ?? "관광지"]
# =============================================
print(df[df["분류"] == "관광지"])

# =============================================
# TODO 8
# 여행지명칭에 "해수욕장" 이 포함된 것만 필터링하세요.
# 힌트 : df[df["여행지명칭"].???.????????("해수욕장")]
# =============================================
print(df[df["여행지명칭"].str.contains("해수욕장")])

# =============================================
# TODO 9
# 지역구분이 제주인 것만 필터링하고
# 여행지명칭, 분류, 주소 열만 출력하세요.
# 힌트 : 필터링 먼저 하고 [["열1", "열2", "열3"]] 로 열 선택
# =============================================
제주데이터 = df[df['지역구분'] == '제주']
print(제주데이터[['여행지명칭', '분류', '주소']])
# =============================================
# TODO 10
# 여행지 누적 추천수가 10 이상인 여행지만 필터링하고
# 여행지명칭, 지역구분, 여행지 누적 추천수 열만 출력하세요.
# 힌트 : df[df["여행지 누적 추천수"] ?? 10]
# =============================================
추천많은데이터 = df[df["여행지 누적 추천수"] >= 10]
print(추천많은데이터[['여행지명칭', '지역구분', '여행지 누적 추천수']])
# =============================================
# TODO 11
# 내용 유형, 카피라이터, 여행지 특징, 여행지 찾아가는 길
# 이 4개 열을 삭제하세요.
# 힌트 : df.????(columns=["열1", "열2", "열3", "열4"])
# =============================================
df.drop(columns=["내용 유형", "카피라이터", "여행지 특징", "여행지 찾아가는 길"])

# =============================================
# TODO 12
# 여행지 누적 추천수 컬럼명을 추천수 로
# 여행지 누적 관심수 컬럼명을 관심수 로 변경하세요.
# 힌트 : df.??????(columns={"기존이름": "새이름"})
# =============================================
df.rename(columns={
    "여행지 누적 추천수": "추천수",
    "여행지 누적 관심수": "관심수",
})
'''
(10319, 18)
Index(['여행지ID', '여행지명칭', '지역구분', '분류', '태그', '내용 유형', '카피라이터', '홈페이지', '주소',
       '여행지 경도', '여행지 위도', '여행지 특징', '여행지 코스소개', '여행지 누적 추천수', '여행지 누적 관심수',
       '여행지 등록일', '여행지 찾아가는 길', '여행지 연관 계절정보'],
      dtype='str')
   여행지ID                     여행지명칭  ... 여행지 찾아가는 길 여행지 연관 계절정보
0    NaN                   구리동해수욕장  ...        NaN         NaN
1    NaN  호텔 아쿠아펠리스 스카이 전망대&스카이 워크  ...        NaN         NaN
2    NaN                강릉 국가유산 야행  ...        NaN         NaN
3    NaN                여수 야경불꽃크루즈  ...        NaN         NaN
4    NaN                    태안봄꽃정원  ...        NaN         NaN

[5 rows x 18 columns]
여행지ID          10319
여행지명칭              0
지역구분               1
분류                 0
태그                 0
내용 유형           5774
카피라이터           5774
홈페이지            6921
주소                 7
여행지 경도            10
여행지 위도            10
여행지 특징          9728
여행지 코스소개        5435
여행지 누적 추천수         0
여행지 누적 관심수         0
여행지 등록일            0
여행지 찾아가는 길      9639
여행지 연관 계절정보     7784
dtype: int64
2
지역구분
전남    1723
경남    1536
강원    1242
제주    1068
부산     950
인천     921
경북     870
충남     805
전북     522
경기     429
울산     239
서울       8
충북       3
대전       2
Name: count, dtype: int64
       여행지ID  ...    여행지 연관 계절정보
1        NaN  ...            NaN
2        NaN  ...            NaN
3        NaN  ...            NaN
4        NaN  ...            NaN
5        NaN  ...            NaN
...      ...  ...            ...
10143    NaN  ...  봄, 여름, 가을, 겨울
10144    NaN  ...  봄, 여름, 가을, 겨울
10145    NaN  ...  봄, 여름, 가을, 겨울
10146    NaN  ...  봄, 여름, 가을, 겨울
10147    NaN  ...          봄, 여름

[4326 rows x 18 columns]
       여행지ID            여행지명칭 지역구분  ...           여행지 등록일 여행지 찾아가는 길  여행지 연관 계절정보
0        NaN          구리동해수욕장   인천  ...  2025-07-09 15:44        NaN          NaN
91       NaN          구리동해수욕장   인천  ...  2025-07-09 15:44        NaN          NaN
104      NaN           양면해수욕장   전남  ...  2025-07-09 15:44        NaN          NaN
293      NaN  정동진해변(정동진 해수욕장)   강원  ...  2022-09-26 17:12        NaN          NaN
294      NaN           옥계해수욕장   강원  ...  2022-09-26 17:12        NaN          NaN
...      ...              ...  ...  ...               ...        ...          ...
10060    NaN          명파 해수욕장   강원  ...   2014-03-28 3:44        NaN           여름
10061    NaN         거진1리해수욕장   강원  ...   2014-03-28 3:44        NaN           여름
10062    NaN          덕원 해수욕장   경남  ...   2014-03-28 3:44        NaN           여름
10064    NaN           하평해수욕장   강원  ...   2014-03-28 3:44        NaN           여름
10065    NaN           신도해수욕장   전남  ...   2014-03-28 3:44        NaN    봄, 여름, 가을

[469 rows x 18 columns]
                       여행지명칭   분류                                주소
5                    제주감귤박람회  관광지            제주 서귀포시 남원읍 중산간동로 7413
13                      도남낚시   체험                  제주 제주시 일주서로 7517
21                  보홀 조이다이브   체험  제주 서귀포시  중산간동로 8383 (서호동, (주)대지)
30     제주오성 순살갈치조림 제주도 중문 본점  음식점           제주 서귀포시  중문관광로 27 (색달동)
32                 영천횟집 탑동본점  음식점             제주 제주시  서부두길 22 (건입동)
...                      ...  ...                               ...
10139                    위미항  관광지            제주특별자치도 서귀포시 남원읍 위미중앙로
10140                    하효항  관광지                 제주특별자치도 서귀포시 쇠소깍로
10141                   모슬포항  관광지            제주특별자치도 서귀포시 대정읍 하모항구로
10142                    신양항  관광지               제주특별자치도 제주시 추자면 추자로
10143                    도두항  관광지             제주특별자치도 제주시 도두항길 28-8

[1068 rows x 3 columns]
                    여행지명칭 지역구분  여행지 누적 추천수
353               신흥 해수욕장   전남          41
470   충청남도 서천군 서면, 유부도 일대   충남          62
471      충청남도 태안군 원동면 신두리   충남          11
495   갯벌체험-조개바지락 잡기(만대마을)   충남          15
2246            문암2리 해수욕장   강원          12
3616               웅천해수욕장   전남          14
3622              원평 해수욕장   강원          14
3623             남일대 해수욕장   경남          28
3624            사량대항 해수욕장   경남          14
3625              여차 해수욕장   경남          13
3626              옥계 해수욕장   경남          16
3627           와현모래숲 해수욕장   경남          20
3628              경정 해수욕장   경북          21
3629              장사 해수욕장   경북          16
3630            기성망양 해수욕장   경북          24

'''