# =============================================
# 해양수산부 여행지 정보 데이터 그룹화 실습
# =============================================

import pandas as pd

df = pd.read_csv("해양수산부_여행지_정보_20250709.csv", encoding='utf-8')

# =============================================
# TODO 1
# 지역별 여행지 개수를 출력하세요.
print(df.groupby("지역구분")["여행지명칭"].count())
# =============================================


# =============================================
# TODO 2
# 분류별 여행지 개수를 출력하세요.
# 관광지가 4326개로 가장 많이 나와야 합니다.
print(df.groupby("분류")["여행지명칭"].count())
# =============================================


# =============================================
# TODO 3
# 지역별 누적 추천수 평균을 출력하세요.
print(df.groupby("지역구분")["여행지 누적 추천수"].mean())
# =============================================


# =============================================
# TODO 4
# 분류별 누적 추천수 합계를 출력하세요.
print(df.groupby("분류")["여행지 누적 추천수"].sum())
# =============================================


# =============================================
# TODO 5
# 지역별 누적 추천수의 평균, 합계, 최댓값, 개수를
# 한번에 출력하세요.
print(df.groupby("지역구분")["여행지 누적 추천수"].agg(["mean", "sum", "max", "count"]))
# =============================================


# =============================================
# TODO 6
# 지역구분과 분류 두 개를 기준으로 묶어서
# 여행지 개수를 출력하세요.
print(df.groupby(["지역구분", "분류"])["여행지명칭"].count())
# =============================================


# =============================================
# TODO 7
# 지역구분이 제주인 것만 필터링한 뒤
# 분류별 여행지 개수를 출력하세요.
# 힌트 : 필터링 먼저 → 그 다음 groupby
# =============================================
제주데이터 = df[df["지역구분"] == '제주']
print(제주데이터.groupby("분류")["여행지명칭"].count())
# KeyError: 'Column not found: 여행자명칭'

# =============================================
# TODO 8
# 지역별 누적 관심수 합계를 구하고
# 가장 높은 지역 순서대로 출력하세요.
# 힌트 : groupby 뒤에 .sort_values(ascending=False)
# =============================================
print(df.groupby("지역구분")["여행지 누적 관심수"].sum().sort_values(ascending=False))
