상품목록 = [
    {"상품명": "마우스", "가격": 35000},
    {"상품명": "키보드", "가격": 89000},
    {"상품명": "모니터", "가격": 350000},
    {"상품명": "USB", "가격": 12000},
]


def 할인하는기능(가격, 할인율):
    return 가격 * (1 - 할인율)


#          기능명                        코드로           결과
#          생  략  매개변수1, 매개변수2  나 : 올           데이터
할인적용 = lambda 가격, 할인율: 가격 * (1 - 할인율)


def 가격낮은순():
    결과 = sorted(상품목록, key=lambda x: x["가격"])
    for 상품 in 결과:
        print(f"{상품['상품명']} {상품['가격']}원")


def 할인가출력():
    for 상품 in 상품목록:
        할인가 = 할인적용(상품["가격"], 0.1)
        print(f"{상품['상품명']} 할인가: {할인가}원")
