'''
지저분한 데이터를 깔끔하게 정리해서 ElasticSearch 에 넣어주는 도구

서버에서 기록(=log) 파일은 아래와 같은식으로 생김
192.168.1.1 - -[15/May/2026:14:33:50] "GET /login" 200 1234
ES 에 그냥 넣으면 문자열 덩어리 하나로 그대로 들어감
             어떤IP에서          언제                무얼했는가 성공했는가
{"message": "192.168.1.1 - -[15/May/2026:14:33:50] GET /login    200      1234"}
{"message": "192.168.1.1 - -[15/May/2026:09:00:01] GET /login    404      1234"}
{"message": "192.168.1.1 - -[15/May/2026:09:00:01] GET /login    401      1234"}

고객센터 -> 저 로그인 안돼요 자꾸 404 떠요

저 마이페이지 접속이 안돼요 권한이 없대요.
--> 개발자는 상태코드가 404 인 것만 검색해서 조회
--> 개발자는 상태코드가 401 인 것만 검색해서 조회 상태 확인
---> 날짜별 요청 수 차트 하기 번거로움

전세계적으로 규칙적인 데이터는 파싱(= 데이터 분리하여 정리 작업) 처리

Logstash 파싱 처리가 완료 된 데이터
{
    "ip": "192.168.1.1,
    "date" : "2026-05-15 :09:00:01",
     "method" : "GET",
     "path" : "/login",
     "status" : 401,
     "bytes":1234
}
개발자는 status, data, path 로 검색하고 집계할 수 있다.

필수는 아니지만
기록(=로그) 파일을 읽어서 -> 필드별로 파싱하고 -> ES에 넣는 프로그램

엘라스틱 스택에서 내부 프로그램들의 언어

Elasticsearch → Java(검색/저장)
Logstash      → Java(파이프라인)
Beats         → Go(가벼운 수집기)
Kibana        → Node.js (UI)

엘라스틱서치는 java 언어가 설치가 안되어 있으면 실행 안된다.
docker 에서 자바를 따로 설치안해도 되는 이유
services:
  elasticsearch:
    image: elasticsearch:8.13 -> 이미지에서 자바 포함해서 엘라스틱서치 설치

사용 방법
input{}  - 어디서 가져올지 (log 파일을 가져온다.)
filter{} - 어떻게 정리할지 (가져온 log 파일을 회사에서 나중에 처리하기 좋게 분리한다.)
output{} - 어디에 저장할지 (분리된 데이터를 저장한다.)
'''
