'''
파이썬 주석을 작성할 때 " 를 앞 뒤로 세 개씩 작성하거나 ' 를 앞 뒤로 세 개씩 작성하면 전체 줄 주석
# 한 줄 주석
띄어쓰기에 굉장히 예민하다.
함수나 기능 작성을 시작할 때 {} 가 아니라 : 을 작성하여 기능작성을 표기한다.

자료형을 표기하지 않는다.
자바의 경우
int a = 1
String b = "안녕하세요"
파이썬의 경우
a = 1
b = "안녕하세요"

연산
/ = 몫 % = 나머지

/ = 몫.나머지  // = 몫  % = 나머지  ** = 제곱

print 종류가 많다.
'''

# 변수 & 자료형
## 파이썬은 "" '' 구분 없다.
name1 = "홍길동"
name2 = '홍길동'
age = 25
height = 160.5
is_학생 = True  # boolean True False ( True = 1 False = 0)

####### 파이썬에서 _ 의미 #######

#  _변수   = 앞에 _ 하나
_name = "홍길동" # 이 변수는 내부에서만 쓸거야. 외부에서 건들지 말자 라는 약속/관례 강제성 없다.

#  변수_   = 뒤에 _ 하나
class_ = '1반'   # 파이썬 예약어랑 이름이 겹칠 때 뒤에 붙임.
type_ = 'admin'  # 개발자도 class 나 type, list 같은 명칭을 사용하고 싶을 때 _를 붙여 사용

# __변수   = 앞에 __ 두 개
__password = "1234" # 클래스 안에서 진짜로 외부 접근을 차단할 때 사용 / 강제성 있다.

# __변수__ = 앞 뒤 각 __ 두 개
# __init__         # 파이썬에서 자체적으로 만든 특별한 예약 변수
# __name__         # 기능이 내장되어 있는 명칭이므로 건드리면 안 됨

# _  = 변수 없이 단독으로 사용되는 언더바

for _ in range(5): # 변수가 필요없지만, 기능의 틀이나 구색에 맞추어야할 때 사용
    print("hello")









"""
파이썬의 최소 사용
RAM 8 이상 권장 데이터분석
RAM 16 이상 권장 AI / 머신러닝
"""
