'''
if 조건:
    조건이 True 일 때 실행
elif 조건2:
    조건이 False 이고 조건2가 True 일 때 실행
else:
    조건과 조건2가 모두 False 일 때 실행

if   - 최초 1회 만 작성
elif - 0개 ~ n개 아예 작성 안해도 되고, 원하는 만큼 작성 가능
else - 0개 ~ 1개 아예 작성 안해도 되고, 맨 마지막에 1개만 작성 가능
'''

점수 = 30
if 점수 >= 90 :
    print("A학점")
elif 점수 >= 80 :
    print("B학점")
elif 점수 >= 70 :
    print("C학점")
else :
    print("F학점")



'''
== 같다
!= 다르다 그게 맞다. 거짓이 아닌게 맞았어
> >= 크다, 크거나 같다
< <= 작다, 작거나 같다
'''
'''
# 힌트
age = int(input("나이를 입력하세요: "))

if age ?:        # 65 이상이면
    print(?)
elif age ?:      # 18 이상이면
    print(?)
else:            # 나머지
    print(?)
결과
나이를 입력하세요: 17
미성년자입니다!
나이를 입력하세요: 25
성인입니다!
나이를 입력하세요: 65
시니어입니다!
'''





