'''
리스트 = 여러 개의 값을 하나의 변수에 담는 것
= 숫자 키로 데이터를 담기 때문에 중복 데이터 가능

과일1번 = "사과"
과일2번 = "포도"
과일3번 = "딸기"

과일들  = ["사과", "포도", "딸기"]

리스트 구조 0번 부터 시작 ArrayList 와 비슷하다
'''
def 리스트문법확인():
    과일들  = ["사과", "포도", "딸기"]
    #           0번      1번     2번
    #          -3번     -2번    -1번   뒤에서 번 째
    print(과일들[0])
    print(과일들[1])
    print(과일들[2])
    print(과일들[-1]) # 맨뒤에서 첫번째 자리에 있는 데이터 확인하기
    #print(과일들[3]) #IndexError: list index out of range

    # 추가 = append("데이터")
    # 삭제 = remove("데이터")
    # 길이 = len(리스트)
    # 정렬 = sort() 오름차순 정렬
    # 포함 여부  "데이터" in 리스트   True False 로 결과가 조회

    # 과일들 맨 뒤에 포도 추가
    과일들.append("포도")
    # 과일들 맨 뒤에 바나나 추가
    과일들.append("바나나")
    # 과일들에서 사과 삭제
    과일들.remove("사과")
    # 과일들의 개수 확인
    과일개수 = len(과일들) # len 으로 반환되는 과일들 내에 존재하는 과일개수를 변수공간에 담아두기
    # 과일들 오름차순 정렬
    과일들.sort()
    # "수박" 과일이 포함되어 있는지 확인 출력
    포함여부 = "수박" in 과일들
    print(과일들)
    print(과일개수)
    print(포함여부)

    # enumerate(목록, 시작번호)  시작번호를 생략하면 자동으로 0부터 번호 붙임
    # for 번호, 과일하나 in enumerate(목록, start=1):

    for 번호, 과일하나 in enumerate(과일들, start=1):
        print(f"{번호}번 {과일하나}")



def 이름목록() :
    이름들 = []
    for i in range(1,4):
        이름 = input(f"{i}번째 이름 입력:")
        이름들.append(이름) #추가

    print("\n=== 입력한 이름 조회 ===")
    for 순번, 이름하나 in enumerate(이름들, start=1):
        print(f"{순번}번 : {이름하나}")

이름목록()





