'''
def   = 기능 하나
class = 기능 여러개 묶음 + 데이터까지 모아놓은 것


명칭 정리
1. 클래스     = 파일 틀 문서
2. 인스턴스   = 클래스로 만들어진 것을 메모리에 일시적으로 띄우는 것
                0개 ~ n개 까지 띄울 수 있다.
3. __init__   = 만들 때 자동 실행( 현재 파일에서  자바에서 생성자와 동일한 효과)
4. self       = 자바의 this 와 동일하고, __init__ 없이는 사용할 수 없다.
                이 파일에서 이 클래스에서 와 같은 효과
5. 메서드     = 클래스 안에서 만든 def 함수 이름
6. 상속       = 부모 기능 물려받기
7. super()    = 부모 기능 가져다 사용하며 추가적으로 기능 붙이기
8. 오버라이딩 = 물려받은 기능을 파일 형태에 맞게 재구성하는 것
9. 다중상속   = 부모 여러개 두기
10.클래스변수 = 자바에서 static 과 비슷
11.인스턴스변수 = 평범한 자바 필드이름과 동일
'''


class 사람:
    종족 = "휴먼"  # static String 종족 = "휴먼"
    def __init__(self, 이름, 나이):
        self.이름 = 이름
        self.나이 = 나이


"""
만약에 자바라면

public class 사람 {
   static String 종족 = "휴먼";  // 모두가 공개적으로 공유할 수 있는 데이터이므로 프라이빗 불가
   private String 이름;
   private int    나이;
   
   public 사람(String 이름, int 나이){
        this.이름 = 이름;
        this.나이 = 나이;
   }

}

"""