class 사람:
    종족 = "휴먼"

    def __init__(self, 이름, 나이):
        self.이름 = 이름
        self.나이 = 나이
    # def 기능이름(self) : 현재 __init__ 생성자에 기입해놓은 필드이름을 사용하겠다. 라는 줄임표기
    def 소개(self):
        print(f"이름 : {self.이름}, 나이:{self.나이}, 종족:{사람.종족}")
        #               self안에 있는 이름에 나이에      사람클래스에 존재하는 클래스 변수에 있는
        #               데이터를 넣고                    종족을 사용하겠다.

A군 = 사람("철수", 25)
B군 = 사람("영희", 20)
C군 = 사람("민준", 23)

# 인스턴스 변수 - 각자 다르다
print(A군.이름)  # 철수
print(B군.이름)  # 영희

# 클래스   변수 - 모두 동일한 데이터가 공유되고 있다
print(A군.종족)  # 휴먼
print(B군.종족)  # 휴먼
print(C군.종족)  # 휴먼

# 메서드 호출 class 사람이라는 내부 안에 만든 기능
A군.소개();  # 이름 : 철수, 나이:25, 종족:휴먼
B군.소개();  # 이름 : 영희, 나이:20, 종족:휴먼

# 클래스 변수에 있는 데이터를 변경하면 모두 바뀐 상태로 공유
사람.종족 = "인간"

# 클래스   변수 - 모두 동일한 데이터가 공유되고 있다
print(A군.종족)  # 인간
print(B군.종족)  # 인간
print(C군.종족)  # 인간
