class 유튜브채널:
    플랫폼 = "유튜브"          # 클래스 변수 - "유튜브"

    def __init__(self, 채널명, 구독자):
        self.채널명 = 채널명
        self.구독자 = 구독자

    def 채널소개(self):
        print(f"채널명: {self.채널명}, 구독자: {self.구독자}, 플랫폼: {유튜브채널.플랫폼}")

A채널 = 유튜브채널("가나다라마바사" , 150)
B채널 = 유튜브채널("파이썬코딩", 82)

# 인스턴스 변수
print(A채널.채널명)   # 네가 넣은 채널명
print(B채널.구독자)   # 네가 넣은 구독자수

# 클래스 변수
print(A채널.플랫폼)   # 유튜브
print(B채널.플랫폼)   # 유튜브

# 메서드 호출
A채널.채널소개()
B채널.채널소개()


class 토스계좌:
    은행명 = "토스뱅크"           # 클래스 변수 - "토스뱅크"

    def __init__(self, 이름, 잔액):
        self.이름 = 이름
        self.잔액 = 잔액

        def 잔액확인(self):
            print(f"이름: {self.이름}, 잔액: {self.이름}원, 은행: {토스계좌.은행명}")

        def 입금(self, 금액):
            self.잔액 = self.잔액 + 금액   # 생성자에 금액을 추가하겠다.
            print(f"{금액}원 입금완료, 현재잔액: {self.잔액}원")

A계좌 = 토스계좌("철수", 10000)
B계좌 = 토스계좌("영희", 50000)

A계좌.잔액확인()
B계좌.잔액확인()

A계좌.입금(5000)   # 입금 후 잔액 15000

# 클래스 변수 변경
토스계좌.은행명 = "토스"   # 아무 이름으로 바꿔봐
print(A계좌.은행명)        # 바뀐 이름
print(B계좌.은행명)        # 바뀐 이름


'''
class 토스계좌:
    static String 은행명 = "토스뱅크"           # 클래스 변수 - "토스뱅크"
    
    String  이름, 잔액;
    
    public  토스계좌(String 이름, int 잔액):
        this.이름 = 이름
        this.잔액 = 잔액

        public void 잔액확인():
            System.out.println("이름: " + this.이름 + ", 잔액:" + this.이름 + "원, 은행: " + 은행명 ")

        def 입금(int 금액):
            this.잔액 = this.잔액 + 금액   # 생성자에 금액을 추가하겠다.
           System.out.println("{금액}원 입금완료, 현재잔액: {self.잔액}원")

토스계좌 A계좌 = new 토스계좌("철수", 10000)
토스계좌 B계좌 = new 토스계좌("영희", 50000)

A계좌.잔액확인()
B계좌.잔액확인()

A계좌.입금(5000)   # 입금 후 잔액 15000

# 클래스 변수 변경
토스계좌.은행명 = "토스"   # 아무 이름으로 바꿔봐
print(A계좌.은행명)        # 바뀐 이름
print(B계좌.은행명)        # 바뀐 이름



'''













