'''
상속 = 부모 클래스 기능을 자식 클래스가 물려받는 것
     = 공통으로 사용할 기능을 하나의 클래스에 작성하고
       개별적으로 공통 클래스를 포함하여 사용하는 것

       자바와 다르게 파이썬 상속은 원하는만큼 다중 상속 가능
       () 안에 상속하고자하는 class 를 원하는 개수 마음껏 작성~
       자바는 extends 뒤에 상속은 딱 하나의 클래스문서 파일만 가능

       자   바 :  public 자식클래스 extends 부모클래스{}
       파이썬  :  class  자식클래스(엄마클래스, 아빠클래스, 할머니클래스, 할아버지클래스,...)



       (       ) - 어떤 자료 어떤 클래스 어떤 기능 어떤 데이터를 넣는지 제한이 없다.


구글 = 유튜브, 지메일, 드라이브 등등
       구글 - 로그인 -> 기능 유튜브 지메일 드라이브 모두 사용할 수 있다!
       굳이
         유튜브에서도 로그인을 만들고,
         지메일에서도 로그인을 만들고
       드라이브에서도 로그인을 만들 필요가 없다.
'''


class 사람:
    def __init(self, 이름):
        self.이름 = 이름

    def 인사(self):
        print(f"안녕 나는{self.이름}이야")
# 파이썬에서 다른 class 의 기능이나 속성을 사용하려면
# 사용하고자 하는 class 명칭을 소괄호() 안에 작성하면 끝
# extends 작성할 필요가 없다.
class 학생(사람):
    def 공부(self):
        print(f"{self.이름}이 공부중")
