'''
자바에서는 interface 라는 용어나 개념이 없다.

대신 pass 단어를 사용해서

기능 / 클래스 틀 / 조건문을 작성하고
나중에 작업하거나 일부러 아무것도 하지 않을 때 pass 넣는다.

'''

class 클래스:
    # 나중에 완성할 클래스 ^^
    pass

def 기능이름():
    #만들어놓고 : 뒤에 들여쓰기를 하여 아무것도 작성하지 않으면 에러 발생
    # 둘 중 하나의 대안 선택 가능
    # 1. print() 를 이용해서 나중에 완성 하겠다 표기
    # 2. pass 작성해놓고     나중에 완성 하겠다 표기
    print(f"나중에 완성하겠습니다.")

def 할일1번():
    """
    000 기능을 구현하고 있는데 문제가 생겼다.
    우선은 코드를 전체 주석처리하고 pass로 둔다음 상사에게 물어보자
    """
    pass
def 할일2번():
    """
    어떤 기능인지 설명을 쓴다.
    000 씨는 000 이 되도록 구현
    """
    pass

def 할일3번():
    """
    어떤 기능인지 설명을 쓴다.
    000 씨는 000 이 되도록 구현
    """
    pass