""" 모델을 만들고 개발자들이 모델을 활용하는 흐름도 """

'''
1. 데이터 수집 = 크롤링 / csv / API 등 다양한 방법을 이용해서 데이터 수집
   - 상황에 따라 sklearn 처럼 만들어진 데이터를 사용할 수 있다.
2. 수집한 데이터 불러오기
   - 필요에 따라 데이터를 확인하기 위하여 matplotlib 이용하여 시각화
3. 수집한 데이터를 학습시킬 모델 선택(논문분석을 많이 한다.)
4. 수집한 데이터와 모델을 준비하여 데이터 학습
5. 학습에 대한 결과 예측 하여 정확도 확인 (정확도가 개발자가 원하는 정도 만들어졌다.)
   - 필요에 따라 예측 결과를 matplotlib 이용하여 시각화
--------------------------------------------------------
원하는 정확도에 따른 데이터 모델 생성
6. 모델 만들기
--------------------------------------------------------
7. 만들어진 모델을 기계에 장착하거나 웹사이트에 장착하여 배포
'''