'''
컴퓨터가 몃이적인 프로그래밍 없이 데이터를 통해 스스로 학습하는 작업
사람이 "이럴 땐 이렇게 해" 라고 일일이 규칙을 짜주는 게 아니라
데이터를 잔뜩 보여주면 컴퓨터가 패턴을 찾아서 스스로 판단

스팸 메일 필터 → 수천 개의 스팸 / 정상 메일을 학습해서 메일이 스팸인지 차단
유튜브    추천 → 내 시청기록을 분석해서 좋아할 영상 추천
얼굴      인식 → 수백만 장의 얼굴 사진을 학습해서 누구인지 구별

크게 3가지 방식
지  도 학습 ─ 정답이 있는 데이터로 학습    (예 : 고양이 / 개 사진 분류)
            이미지 조회, 마스크 착용 유무
비지도 학습 ─ 정답 없이 데이터 패턴만 찾기 (예 : 고객 군집 분석)
강  화 학습 - 보상 / 패널티를  통해 학습   (예 : 바둑 AI, 게임 AI)

데이터 많이 보여주면 알아서 똑똑해지는 알고리즘

처음 머신러닝을 접하는 개발자들이 많이 사용하는 방식
pip install scikit-learn

scikit-learn
 - 파이썬에서 머신러닝을 쉽게 쓸 수 있게 만들어놓은 라이브러리(도구 모음)

 머신러닝 알고리즘을 처음부터 직접 작성하면 수백 수만 줄이된다.
 scikit-learn 위와 같은 알고리즘을 미리 만들고, 가져다 개발자들이 사용하면 되는 구조

 계산기를 몰라도 계산기를 사용할 수 있는 것처럼 머신러닝 초기 기능 제공

 존재하는 종류
 분  류 - 스팸이냐 아니냐 고양이냐 개냐 판단
 회  귀 - 집값 예측, 주가 예측
 군  집 - 비슷한 고객끼리 묶기
 전처리 - 데이터 정규화, 결측값 처리
 평  가 - 모델이 얼마나 정확한지 측정

 작성 방법
 from sklearn.가져올기능 import 사용할기능

 model = 기능 model 에 담아두기
 model.fit(X_train, y_train) # 학습
 model.predict(X_test)       # 예측
 model.score(X_test, y_test) # 정확도
 위 4가지는 모든 모델에서 똑같이 사용, 모델만 바꾸면 나머지는 동일하게 사용 가능
'''
# sklearn 에 존재하는 붓꽃 분류
# from 큰창고.작은창고 import 필요한 것
# 큰 창고 안에 용도별로 작은 창고가 있고, 거기서 필요한 것만 꺼내사용 이름이 길 경우 as 로 별칭을 붙여 사용가능
from sklearn.datasets import load_iris                 # sklearn 에서 만든 150개의 붓꽃 데이터가 준비되어 있다.
from sklearn.model_selection import  train_test_split  # 데이터를 학습용이랑 테스트용으로 나눠주는 도구
                                                       # 예를 들어 100개의 데이터가 있으면 80개는 공부용, 20개는 시험용으로 자동으로 데이터 쪼개준다.
from sklearn.neighbors import KNeighborsClassifier     # KNN 이라는 머신러닝 모델을 가져오는 것
                                                       # KNN 새로운 데이터가 들어오면 주변에 가장 가까운 이웃들을 보고
                                                       # 얘네가 다 고양이니까 너도 고양이겠다 라는 식으로 판단하는 알고리즘
from  sklearn.metrics import  accuracy_score           # 모델이 얼마나 맞혔는지 정확도를 계산해주는 도구 예측값이랑 실제 정답을 비교하여 몇 % 맞았는지 숫자로 알려준다.

# sklearn 은 회사에서 자주 사용하지 않는다. 회사마다 원하는 AI가 다르고, 코드가 100% 동일하다는 보장은 없다.
# 모델을 불러오고 / 모델선택 학습 / 예측 / 정확도 확인 -> 결과 시각화나 페이지에서 확인할 수 있는가
# 에 대해서 공부!

# 1. 데이터 불러오기
붓꽃 = load_iris()
X = 붓꽃.data # 입력값 (꽃잎길이, 너비 등)
y = 붓꽃.target # 정답(0:setosa, 1:versicolor, 2:virginica
# 왜 대문자 X 를 사용하는가 data target





