'''
선형 회귀
Linear Regression
1885년, 프랜시스 골턴
아버지 키와 아들 키의 관계를 연구하다가 이상한 것을 발견
키   큰 아버지의 아들 → 아버지보다는 작은 경향
키 작은 아버지의 아들 → 아버지보다는   큰 경향
아들의 키는 평균으로 돌아가려는 경향이 있다.
평균으로의 회귀(Regression to the Mean)
회귀(Regression) 단어가 통계에서 사용됨

나중에 수학자들이 이 개념을 일반화해서 X로 Y를 예측하는 방법으로 발전시킴

선형회귀가 나온 근본적인 이유
인간의 욕구에서 출발함

"지금 알고 있는 것으로 모르는 것을 예측하고 싶다"

공부시간 → 시험점수 예측
집  크기 → 집   값 예측
온    도 → 아이스크림 판매량 예측

예측을 하려면 관계를 수식으로 표현해야 한다.
가장 단순하게 관계를 표현할 수 있는 방법이 무엇일까? → 직선

y = ax + b
a = 기울기 (x 가 1 늘면 y는 얼마나 변하는가)
b = 절  편 (x = 0 일 때 y값)

선형 회귀는 데이터를 가장 잘 설명하는 직선의 a,b를 찾는 것

비선형
- 사실 세상의 대부분은 비선형이다.

선형(=직선으로 설명 가능한 것)
키       → 몸무게 (어느정도)
공부시간 → 성적    (단순화)

비선형인 것(=직선으로만 설명 불가능한 것)
단순한 가정으로 결과가 나오지 않는 복잡한 상태
코로나 확산
경제 성장 후 침체
직선만으로는 못잡는 관계

'''
"""
선형회귀 종류
아래 대부분은 sklearn 에서 제공하는 모델이다.

기초  OLS                       가벼운 기초라인 데이터에서 많이 사용
중급  Lasso,Ridge               피처(속성설정)가 많은 정형 데이터
중급  ElasticNet + GridSearchCV 캐글 / 대회에서 많이 사용
고급  XGBoot 기타 등등          비선형데이터  

OLS 하나만 제대로 사용해도 나머지들은 사용하는데 크게 별 차이가 없다.

실시간 영상처리 하는 ai 모델 논문 발표!!!!
YOLO -> yolo1, yolo2, yolo3 , ... yolo 를 바탕으로 만들어진 다수 모델 

ai 모델에는 굉장히 많은 모델 존재 / 최신이라 해서 좋은 것 xxx / 사람들이 써? 나도~!
데이터분석가 / ai 모델 개발자가 원하는 결과에 걸맞는 모델을 사용하고 있는가?
R&D = Research & Developer

1. OLS(Ordinary Least Squares) - 최소 제곱법
1800 년 대 가우스 오차를 최소화하는 직선을 수학적으로 표현하자! 통계학의 근본이 된다.
직선이 안맞으면 곡선으로 라는 자연스러운 확장
실제값과 예측값의 차이의 제곱합을 최소화하는 직선

2. Ridge / Lasso / ElasticNet - 정규화 회귀
Ridge - 1970 년 대 데이터 피처(세부설정)가 늘어나면서 OLS가 불안정해지는 문제가 발견되었고,
        Hoerl & Kennard 계수에 제약을 걸면 어떨까 제안
Lasso - 1996년대 Tibshirani Ridge는 계수를 줄이기만 하는데, 아예 0으로 만들어서 피처(세부설정)선택도 같이 하면 어떨까
ElasticNet - 2005년대 Zou & Hastice 피처끼리 상관관계에 있을 때 Lasso 가 불안정하다 Ridge 섞으면 해결된다! 완성
교차검증 - 1970 년대 모델이 새 데이터에서도 잘 작동하는지 어떻게 아는가? 문제를 해결하려고 나온 것

* 피처 = 입력 변수 
    만약에 집값을 예측하고 싶다. 
            집값을 예측하기 위해서 입력으로 작성하는 데이터들 : 면적(평수) / 역세권 / 건축 연도 / 방 개수
    방 개수, 면적, 역세권, 건축 연도 와 같은 세부 설정 데이터를  피처라고 한다.
    예측에 쓰이는 재료들
* 계수 = 각 피처가 얼마나 영향을 주는지 나타내는 숫자
    만약에 집값을 예측하고 싶다. 
            집값 = (면적 * 500) + (방개수 * 300) + (역거리 * -200) 
            여기서 500 300 -200 계수
            각 재료가 결과에 얼마나 기여하는지 나타내는 가중치
    계수 = 묶을 / 연결할 계, 숫자 수   변수에 묶여있는 숫자 변수와 함께 작용하는 숫자 데이터
피처 = 재료(뭘 가지고 예측할 것인가) 계수 = 그 재료의 중요도/영향력(얼마나 반영하냐)
 
OLS의 과적합 문제를 페널티(정규화 항)를 추가해서 해결하는 방법
Ridge는 L2 정규화로 계수를 0에 가깝게 줄이지만 완전히 0으로 만들지는 않는다.


3. 다항 회귀
- 직선으로 못 맞추는 비선형 데이터(곡선데이터)를 고차향으로 변환해서 선형 모델로 푸는 것
- 실무에서는 그렇게 사용하지 않는다.
- 다항 회귀 = 여러 항목 을 바탕으로 예측을 해야하는 경우 차라리 그냥 XGBoost, LightGBM 등 모델 사용
              복잡하게 하지 않고, 복잡하게 할 일을 만들어놓은 모델을 사용

4. 교차검증
train_test_split 로 데이터를 딱 한번만 나누면 어떻게 나누냐에 따라 성능은 천차만별이 된다.
데이터 나누는 작업을 여러 번 다르게 나눠서 평균 성능을 예측하겠다.



 Regression (회귀)
 - 정답이 없다. 예측값이 실제값에 얼마나 가까운지가 정답
 평가지표는 오차가 작을수록 좋다.
 RMSE = 낮을수록 좋다.
  RMSE = 평균적으로 예측을 얼마나 틀렸는가? 오답이 적을 수록 좋다.
 R²   = 1에 가까울수록 좋다(최대 1)
   R²   = 내 모델이 데이터를 얼마나 잘 설명하는지 숫자로 나타낸 것 0~1
   R² = 0.8 → 80%
   R² = 0.5 → 50%
   
Classification (분류)
- 정답이 맞냐 틀리냐 기준
Accuracy = 정확도가 높을수록 좋다 최대 100 또는 1.0

회귀에서 많이 사용하는 연습용 데이터 sklearn에서 제공한다.
- 보스턴 집 값 -> 이슈로 인하여 2023년 삭제
- 캘리포니아 집값 
- 당뇨병 데이터

"""












