import os

from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import MultinomialNB

"""
1. 머신러닝(ML)이란?
데이터를 보고 스스로 규칙을 찾아내는 기술
자바나 파이썬 기초 코딩 프로그래밍은 사람이 규칙을 직접 작성했다면,
머신러닝은 데이터를 주면 컴퓨터가 규칙을 스스로 학습한다.

2. 딥러닝(DL)이란?
머신러닝의 한 분야, 뇌의 뉴런 구조를 모방한 인공신경망(ANN)을 여러 층(Layer) 쌓은 것

머신러닝 안에 딥러닝이라는 개념이 포함되어 있다.


항목                      머신러닝                                딥러닝
특징 추출     컬럼(=특징,피처)를 사람이 직접 작성               자동으로 학습
데이터량                  소량 가능                             대용량 필요
연산 자원                 CPU로 충분                            GPU 거의 필수
해석 가능성               비교적 쉬움                             어려움
대표 알고리즘     랜덤포레스트, SVM, XGBoost                CNN, RNN, Transformer
잘 쓰는 곳        정형 데이터(표 형태의 데이터)             이미지, 음성, 텍스트


어쩌다가 딥러닝이 필요해졌는가?
욕설 감지 예제에서 머신러닝은 텍스트 → 벡터를 이용해서 숫자 변환해서 패턴을 찾아야 한다.
예를 들어 나이브베이즈 와 같은 모델에서 텍스트를 감지할 때 숫자로 처리해서 패턴을 찾는다.
머신러닝에서 텍스트 와 관련된 대부분의 모델들은 보통 모두 숫자화를 해서 작업을 한다.

이미지라면?
고양이 사진 한 장 = 픽셀 이미지를 이루는 컬러 데이터 수백만 개
머신러닝한테 이게 고양이야 라고 학습시키려면 개발자가 직접 귀가 뾰족하다 수염이 있다.
눈이 동글다 같은 특징을 뽑아내서 숫자로 변환해주어야 한다.

Feature Engineering(특징 추출) 이라고 하는데, 사람이 모두다 피처를 직접 전처리 해주어야 하여
한계가 발생할 수 있다.

그래서 사람의 뇌를 참고해서 개발에 따른 모델에 한계를 최소화하자! 생각을 하게 된 것
사람은 고양이 사진을 볼 때 "귀가 뾰족한지 측정"하고 판단하는 것이 아니라
그냥 눈으로 보면 바로 안다.

사람의 뇌는 어떻게 고양이라 인식하는가
눈으로 빛 감지 → 신경계 인식 → 귀, 눈, 수염 같은 부위 인식 → 고양이다
추상화하여 판단
이와 같이 사람이 생각하는 형태를 따라 만든 것이 인공신경망이라는 이름이다.

뉴런
신호를 받는다 → 일정 기준이 넘으면 → 다음 뉴런으로 전달한다.
이런 뉴런을 코드로 수천개 만들고 여러 줄로 쌓은게 인공 신경망

층[Layer] 은 왜 여러개 인가
[입  력  층]   픽셀 데이터를 받음       (눈으로 빛 받는 단계)
      ↓
[은닉층 1번]   선, 경계 감지            (윤곽 파악)
      ↓
[은닉층 2번]   귀, 눈, 코 모양 파악     (부위 인식)
      ↓
[은닉층 3번]   전체적인 얼굴 구조 파악  (윤곽 파악)
      ↓
[출  력  층]   고양이 / 강아지 판단

뉴런 = 그리스어 = 신경, 힘줄
- 1940년대 신경과학자들이 뇌를 연구하다 발견한 것
- 사람의 뇌 = 뉴런 약 860억 개가 서로 연결된 구조
- 뉴런 하나 = 신호 받고 → 판단하고 → 다음으로 전달

1943년 맥걸록 & 피츠 수학자
- 뇌가 이렇게 작동하면, 이걸 수학으로 흉내낼수 있지 않을까?
- 해서 뉴련을 수학 함수로 표현하게 시작점, 
  이름은 그대로 뉴런이라는 명칭을 가져와서 수학을 만들기 시작
  
인공신경망(Artificial Neural Network)
            인공      신경의 연결구조=망
뇌의 신경망 구조를 인공적으로 만들었다 해서 인공신경망

Layer = 층, 겹
뉴런들을 한 줄로 묶은 단위를 층이라고 부른 것
860억개의 뇌 힘줄에 분야와 파트가 있다.
인공신경망에도 분야와 파트를 생성한 것
데이터발견  --- 입력층
데이터분석1 --- 은닉층1
데이터분석2 --- 은닉층2
데이터분석3 --- 은닉층3
........... --- .......
데이터결과  --- 출력층

데이터를 발견하고 분석하고 결과를 내릴 때 우리 몸처럼 단계가 존재한다. 레이어로 표현

사람을 보았다(=데이터발견)
전체 형태를 확인한다(=데이터분석)
눈이 크고 코가크고 입이크다(=데이터분석)
눈 색상은 어떻고 코는 어떻고 입 색상은 어떻다.(데이터분석)
앗.. 나의 천년의 이상형(=데이터출력)
"""




"""
예를 들어 단어 검색
- 전통 프로그래밍의 경우 : 데이터 + 개발자가 규칙을 하나하나 작성 → 결과 만듦
                   개발자가 생각하지 못한 규칙이 존재하면 규칙을 세부적으로 추가 / 수정 /삭제
                   
- 머   신  러  닝의 경우 : 데이터 + 결과 → 규칙을 모델이 찾아서 생성하여 학습

"""


## 욕설 댓글 자동 차단 시스템
# 1. 전통 프로그래밍
def 욕설_금지(댓글):
    금지어 = ["바보", "멍청이", "욕두문자"]

    for 단어 in 금지어:
        if 단어 in 댓글:
            return "차단"
        return "통과"


# 현실에서 문제가 발생
# 유저가 "바 보" 라고 띄어쓰기를 해서 올리면 금지어에 포함되지 않아 못잡음
# 유저가 "ㅂㅏ 보" 라고 자음 분리해서 올림 금지어에 포함되지 않아 못잡음
# 유저가 "babo" 라고 영어로 작성하여 올리면 금지어에 포함되지 않아 못잡음
def 욕설_금지_추가버전(댓글):
    금지어 = ["바보", "멍청이", "욕두문자", "바 보", "바    보", "babo", "ㅂr보"]


# 개발자는 생각하지 못한 규칙이 나타날 때 마다 코드를 계속 수정해서 추가해야한다.
# 사람이 수정하고 작성하며 따라가는 데 한계 존재할 수 있다.

# 2. 머신러닝
# 규칙은 몰라도 된다. 데이터 + 정답만 주면 모델이 스스로 규칙을 찾아낸다.
# 개발자가 하는 일 예시 데이터와 정답 사용할 모델만 선택
데이터 = [
    ("바보야", "욕설"),
    ("바 보야", "욕설"),
    ("ㅂㅏ 보야", "욕설"),
    ("ㅂr 보야", "욕설"),
    ("ㅂr 뽀야", "욕설"),
    ("오늘 날씨 참 좋다.", "정상"),
    ("고마워!", "정상"),
    ("babo야", "욕설"),
]
# 과 같은 식으로 데이터를 준비하여
X_train, X_test, y_train, y_test = train_test_split(
    "X",
    "y",
    test_size=0.2,
    random_state=42
)
model = MultinomialNB()
model.fit("X_train", "y_train")
테스트 = model.predict("X_test")
