import os
"""
scikit-learn
- 머신러닝 라이브러리
- 선형 회귀, 결정 트리, 랜덤포레스트 등 전통적인 알고리즘이 존재
- GPU를 사용하지 않으며, 데이터 전처리, 모델 평가, 교차검증 도구에 있어
  딥러닝 프로젝트에서도 전처리 단계에서 자주 사용된다.
  데이터 작업 처리 사용
TensorFlow
- 구글이 만든 딥러닝 프레임워크
- TensorFlow 는 행렬 미분, 역전파, GPU 메모리 관리를 모두 작성해야하는 번거로움 해소
  초기에 개발을 배울 때 사용 실무에서는 사용을 거의 안한다.
Keras
- TensorFlow 위에서 동작하는 고수준 API
- 레이어 쌓고, 컴파일하고, 학습시키는 것을 몇 줄로 끝낸다.
- 초기에 개발을 배울 때 사용 실무에서는 사용을 거의 안한다.

위 세가지는 가끔 사용하기는 하나 우리가 처음에 스스로 밥을 먹기 전까지
어른들, 도구의 도움을 받지만 (=scikit-learn, TensorFlow, Keras) 
나중에 스스로 먹을 수 있는 것처럼 나중에 개발자들은 컴퓨터에 대한 자아가 생성되고,
목표와 자아에 따라 직접적으로 모든 것을 세팅하길 원한다.

회사에서 지정하는 목표, 선호는 모델에 따라 어떤 전처리, 어떤 모델, 어떤 학습을 시키게 될지는
알 수 없다.

하지만 

데이터 수집 - 전처리 - 모델 - 학습 - 학습할 때 커스텀을 해주면 정확도가 올라갈 수 있다.

와 같은 개념을 이해하고 공부하기 위하여 필요

딥러닝에서 초기에 텐서플로우와 케라스 설치 필요

구글에서 인정하는 텐서플로우 자격증은 그렇게까지 따는 추세는 지났다.
AICE - 국가에서 인정되는 단계 자격증 취득하는 것이 낫다.

텐서플로우와 케라스 설치 방법
pip install tensorflow 해주면 설치된다. 텐서플로우 안에 케라스가 내장되어 있다.
"""