# warning 메세지가 보기 싫을 때 끄는 방법
import os
os.environ['TF_ENABLE_ONEDNN_OPTS'] = '0' # ONDNN 만 안하겠다.
os.environ['TF_CPP_MIN_LOG_LEVEL'] = '3' # 0=전부 출력, 1=INFO제거 2=WARNING제거 3=전부출력안함
import tensorflow as tf

# 1. 가짜 데이터로 텐서플로우 이용해보기
X = tf.random.normal((100, 10))  # 샘플 100개 컬럼 10개
y = tf.random.normal((100, 1))  # 정답 100개 컬럼  1개
'''
tf. 구글에서 개발한 텐서플로우 자체에서 만든 랜덤으로 
귀로빈섬(=파이썬창시자)가 만든 random과 착각해서는 안된다.
둘은 다른 것이다.
tf
.random : 무언가를 임의적으로 작업한다.
 - .normal() = 0 근처 숫자가 많이 나오게끔 만들겠다.    가중치 초기화
 - .uniform() = 정해진 범위 안에서 골고루 나오게끔      범위를 지정해서 무언가 해야할 때
 - .set_seed() = 랜덤인데 항상 같은 결과가 나오게 고정  같은 결과를 재현해야 할 때
 ==== 위 세가지 많이 사용 ====
 - .shuffle() = 순서를 랜덤으로 섞어준다.               데이터 섞을 때
 - .truncated_normal() = normal 과 비슷한데 크기가 너무 크거나 작은 값은 잘라내겠다.
                                                        안정적으로 초기화 진행할 때
Sequential
- 레이어를 순서대로 쌓는다
- AI 뇌를 만들 때 어떤 구조로 뇌를 만들 것인지 층층이 쌓는 것
- 개발자가 AI 뇌를 만들 때 어떤 형태로 뇌를 만들 것인지 레고 블록을 쌓듯이, 
  층을 원하는 만큼 만드는 것
layers   = AI 뇌의 층으로 용도에 따라 종류가 다르다.
기본층
- .Dense = 빽빽한 촘촘한 뜻 모든 점이 다음 층 모든 점이랑 빠짐없이 전부 연결되어 있다.
이미지용
- .Conv2D = 이미지에 특징을 찾아내는 층 / 사진을 인식할 때 사용
-     1층 Conv2D 에서 선     점 같은 단순한 특징을 찾고
-     2층 Conv2D 에서 눈     코 같은 복잡한 특징을 찾고
-     3층 Conv2D 에서 얼굴 전체 같은 고차원 특징을 찾는다. 왜 같은 뇌를 개발자가 작성
- .MaxPooling2D = 이미지 크기를 줄여주는 층 / 학습할 때 이미지가 너무 크면 학습하는데 시간이
                  오래 걸리므로 이미지 사이즈를 임의적으로 줄여서 사용
                  Conv2D와 같이 사용
                  
                  보통 Conv2D를 이용한 다음에 Conv2D에 존재하는 데이터를 바탕으로
                  중요해보이는 데이터만 남겨두고 나머지 필요없는 데이터를 버릴 때 사용
                  Conv2D       → MaxPooling2D 이런식으로 많이 사용
                  MaxPooling2D → Conv2D       이렇게는 사용하지 않는다.
                  
- .Flatten      = 2D이미지를 1D 일자로 펴주는 층
                  Conv2D 로 (표형태)로 나온 결과를 Dense 로 작업해야할 때 중간에 사용
                  Dense 같은 경우 표가 아닌 목록 형태로 되어 있는 데이터만 받아서 사용할 수 있다.
                  만약에 Conv2D에서 Dense 로 가야할 일이 있을 때 중간에
                  Conv2D → Flatten → Dense  넣어 왼쪽과 같이 사용
텍스트/순서용
- .LSTM        = 앞 뒤 순서를 기억하는 층. 문장, 주가 예측할 때 사용
                 문장의 순서를 기억할 때 사용
                 Dense 의 경우 나는 / 밥을 / 먹었다 에서 순서를 모른다.
                 LSTM  의 경우 나는 → 밥을 → 먹었다 흐름 순서를 기억한다.
                 글자에서는 DENSE 보다 LSTM 사용한다.
                 
                 
- .Embedding   = 단어를 숫자로 바꿔주는 층 / 자연어 처리할 때 사용(파파고 만들 때)
학습 도움용
- .Dropout     = 학습할 때 뉴런 일부를 랜덤으로 꺼냄. 외워버리는 것을 방지
- .BatchNormalization = 숫자 크기를 일정하게 정규화해줌. 학습 안정시킬 때 사용

activation
relu
input_shape
compile
optimizer
adam
loss
mse

'''

# 2. 모델 만들기
model = tf.keras.Sequential([   #뇌만들기 시작!
    # 1층 뇌 신경이 5개이고, 음수는 0으로 바꿀 것이며, 하나의 데이터당 컬럼 10개를 기준으로 공부한다)
    # input_shape은 컬럼을 몇개 사용할 것인지에 따라 값이 바뀜
    # 보통 사용하고자 하는 컬럼 개수와 첫 번째 Dense 의 input_shape 수는 동일
    # 만약 2D나 3D의 경우
    # 1D =  input_shape=(10,       ) 정답이 1개이기 때문에 비워놓는다.
    # 2D =  input_shape=(28,     28) 엑셀 표 전체 흑백 이미지도 2D이다.  흰색 검정
    # 3D =  input_shape=(28, 28, 3)  컬러 이미지의 경우 3D 이다 왜냐하면 빨강 초록 파랑으로 이루어진 데이터이므로 3개 데이터가 필요

    # 주가 예측 1d 인가요? 상황에 따라 다르다.
    # 단순히 오늘 주가 하나만 보고 내일 예측한다 1D가 맞음
    # 오늘 주가[삼성오늘주가]

    # 여러 정보를 같이 사용하는 주가 예측        2D
    #         시가    종가    거래량    환율 ...
    #  1일차
    #  2일차
    #  3일차                                         표 형태로 이루어져 있기에 2D

    # 표형태로 된 데이터를 분석 2d  컬러 이미지 다. 3d

    # 과 같이 작성
    tf.keras.layers.Dense(5, activation='relu', input_shape=(10, )), #input_shape=(10, 0))
    tf.keras.layers.Dense(1)
])
"""
Sequential = AI 뇌 만들겠다. ([]) AI뇌를 어떻게 만들지 커스텀
activation = 활성화 함수 = 머신러닝의 스케일링과 유사
- relu = 양수는 그대로 통과, 음수는 0으로 만듦
   거의 모든 모델의 중간층에 기본 사용
   이미지 인식, 집값 예측 등 뭐든 다 사용
   
- sigmoid = 어떤 숫자든 0~1 사이로 교체 ( sklearn MinMax 스케일러 와 비슷 )
  아주 큰 숫자 0.99  보통 0.5  아주 작은 숫자 0.01
  스팸메일이나, 암이냐 ,아니냐, 합격이냐 불합격이나 같은 둘 중 하나 고르는 모델의
  마지막 층 사용
  
- softmax = 여러 숫자를 전부 합이 1이 되는 확률로 바꿈
  개 →0.7 고양이 →0.2 새 →0.1 합이 1이 되도록 설정
  이 사진이 뭔가요? 처럼 여러 개중 하나 고르는 모델 마지막 층 사용 손글씨 숫자 인식이나
  꽃 종류 같은 다중 분류에서 사용
  
- tanh    = 어떤 숫자든 -1~1 사이로 교체 
  음수도 표현할 수 있어, 문장, 주가처럼 순서가 있는 데이터 모델 중간층 사용
  LSTM이랑 같이 사용되는 경우가 많다.
- linear  = 숫자를 안바꾸고 그대로 사용
    집값, 온도,주가처럼 숫자 자체를 예측하는 가장 마지막 계층에서 0이나 1이냐가 아니라
    실제 숫자로 나와야할 때 사용
- leaky_relu = relu 랑 거의 같은데 음수를 0으로 안 만들고 아주 작은값으로 살려주는 것
  relu를 잘못쓰면 학습 자체가 안될 때 사용
  relu가 너무 많은 신경 뇌를 죽여버릴 때 쓰는 relu 개선판
- elu       = leaky_relu 비슷하나 더 부드러운 곡선
            leaky_relu 보다 학습이 안정적이나 느림 정확도 중요한 모델 사용

언제 뭘 쓰냐
중간 층 (은닉층) → relu 기본, 안되면 leaky_relu 사용
마지막 층(출력층)
    둘      중 하나 → sigmoid (스팸/정상 비정상, 합격/불합격)
    여러 개 중 하나 → softmax (개/고양이/세)
    숫      자 예측 → linear  (집값, 주가, 온도)

"""
# 3. 학습 준비 + 학습
model.compile(optimizer='adam', loss='mse')
"""
시험을 보고 틀렸다 → 얼마나 틀렸는지 어떤 방향으로 고쳐야 하는지 방법이 여러가지인 것처럼
                     AI도 틀린 것에 대하여 고치는 방법이 여러가지  
compile    = AI 학습 세팅 방법
optimizer  = AI가 틀렸을 때 어떻게 고칠지 고치는 방법 작성
- .adam    = 가장 많이 쓰임 빠르고 안정적
    ADAptive Moment estimation = 상황을 보면서 학습 속도를 알 아서 조절
    잘 되고   있으면 학습속도를 빠르게
    잘 안되고 있으면 학습속도를 느리게 하거나 방향 조정
    거의 모든 모델에 기본 사용 이미지 인식 / 텍스트 / 주가 예측 등
    처음에는 무조건 adam 을 사용해보고 상황에 따라 교체
    
- .sgd     = 확률적 경사하강법 / 기본 중의 기본
    Stochastic Gradient Descent = 틀린걸 조금씩 꾸준히 고쳐가는 가장 기본 방법
    단순하고 느리지만 확실하며 학교에서 AI 원리 배울 때 사용 실전에서 많이 사용하지 않음
    
- .rmsprop = RNN 에 주로 사용
    학습 속도를 최근 기록 기반 조절
    최근에 많이 변했으면 천천히
    최근에 조금 변했으면 빠르게
    문장,주가 처럼 순서 있는 모델(LSTM 같은 것)에 잘 맞는다.
- .adagrad = 학습률 자동 조정
    자주 나오는 데이터는 천천히, 드물게 나오는 데이터는 빠르게 학습
    "의" "는" "이" 같은 자주 나오는 단어 천천히
    "광합성"            드물게 나오는 단어 빠르게
    텍스트, 검색어 처럼 단어 빈도차이가 큰 모델 사용 학습이 느려지는 단점
    
loss      = 얼마나 틀렸는지 재는 방법 / 숫자가 작을수록 잘 맞추는 것

"""
model.fit(X, y, epochs=100, verbose=1)
"""
fit 의 종류 
가장 많이 사용 되는 것 = epochs  verbose  batch_size  callbacks  

epochs 
- 같은 데이터를 몇  번 해서 반복하여 공부할지 기입
- 사람도 한 번봐서 모르는 것처럼 같은 데이터를 여러 번 봐야 외우듯이 AI도 여러번 
  보게끔 하여 공부시킨다.
- 에포크가 클수록 메모리나 gpu 사용량도 커진다. 컴퓨터 사양에 따라 적절히 숫자 크기 작성
batch_size
- 한 번에 처리하는 샘플 수 기본값 32이 이며,
- 마찬가지로 한 번에 처리하는 샘플 수가 많을 수록 GPU 메모리 소모 크다.
step_per_epoch
- 에폭 당 배치 수
validation_split
- 검증 데이터 비율
validation_data
- 별도 검증 데이터 직접 지정
callbacks
- 학습이 원하는 결과까지 나왔다. 조기 종료, 모델 중간 저장 등 다수 작업 가능
shuffle
- 에폭마다 데이터 섞기 (기본값 : True)
class_weight
- 클래스 불균형 보정
verbose
- 0 = 아무것도 학습하는 동안 개발자에게 안보여주겠다. 개발자는 끝나고나서 결과만 확인
- 1 = 진행바 + 결과 보여줌
- 2 = 진행바 없이 텍스트로만 보여줌
시간이 없어 급해 0을 사용해서 출력하는 메모리소비 없이 모델 생성
시간 여유 있고 나는 제대로된 모델 학습을 하고 있는지 궁금해 1 사용
아.. 나는 시간 여유는 있는데.. 굳이 하나하나 봐야해? 진행바 없이 텍스트로만 진행상황 조회

"""

























"""
WARNING: All log messages before absl::InitializeLog() is called are written to STDERR
I0000 00:00:1780281484.620415   16396 port.cc:153]
Tensorflow 내부 로그 시스템이 초기화 되기 전에 메세지가 출력될 수 있다 와 같은 단순 알림

oneDNN custom operations are on. You may see slightly different numerical results due to floating-point round-off errors from different computation orders. To turn them off, set the environment variable `TF_ENABLE_ONEDNN_OPTS=0`.
intel 에서 추가적으로 만든 딥러닝 연산 최적화 라이브러리
cpu 연산을 더 빠르게 해준다.
활성화되어 있어, 부동소수점 연산 순서가 달라질 수 있고, 
그로 인해 결과값이 아무 미세하게 달라질 수 있다. 안내문구

위 두가지는 정보성 메세지 이므로 그냥 두어 된다.
"""