# 영어 문장으로 작성된 리뷰가 긍정적인지 부정적인지 판단

"""
일반 신경망(NN)은 기억이 없는 AI
질문 하나를 받고, 답하고 끝
다음 질문이오면 이전 것을 잊음

RNN 은 이전 것을 기억하면서 다음을 예측하는 AI

유튜브 자동완성 검색창 "마인크래" 라고 치면
마인크래프트 가 뜬다.
앞 글자들을 기억해서 다음 글자를 예측하는 것

시계열 = 시  간 시
Time     이어길 계
Serise   나열할 열
         시간 순서대로 이어진 줄
시간 순서가 있는 데이터
시리즈물 시즌1 시즌2 시즌3 이어지는 것처럼
시계열도 데이터가 시간 순서대로 이어진 것 의미

RNN 은 모델은 시계열 데이터에서 많이 사용
단점
-> 오래된 것을 잘 잊는다. 이것을 업그레이드 한것이
LSTM, GRU 모델이 존재
요즘 ChatGPT 가 쓰는 모델은 위 두가지를 또 업데이트한
Transformer 방식 사용
"""

# 텐서플로우에 존재하는 IMDB 영화 리뷰 데이터 이용해서 모델 만들기
# 텐서플로우가 기본으로 제공하는 데이터
# 영화 리뷰 텍스트 25,000개 → 긍정(1) / 부정(0) 분류하는 모델 만들기

import tensorflow as tf
from tensorflow.keras.datasets import imdb
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Embedding, SimpleRNN, Dense
from tensorflow.keras.preprocessing.sequence import pad_sequences

# ========================
# 1. 데이터 불러오기
# ========================
# 자주 쓰이는 단어 상위 10,000개만 사용
단어개수 = 10000
(X_train, y_train), (X_test, y_test) = imdb.load_data(num_words=단어개수)

# 불러온 데이터 상태 확인하기
print(f"훈련 데이터 수 : {len(X_train)}")
print(f"훈련이 잘 되어있는지 확인하는 데이터 수 : {len(X_test)}")
# 만약 데이터를 1개만 가져와서 제대로 된 데이터가 맞는지 확인 X_train[0]
# 만약 데이터를 1개만 가져와서 제대로 된 데이터가 맞는지 확인하는데 딱 10글자만조회 X_train[0] [:10]
print(f"리뷰 예시(1개의 데이터를 가져와서 내부 10개정도만 확인) : {X_train[0][:10]}")
# 리뷰 예시(1개의 데이터를 가져와서 내부 10개정도만 확인) : [1, 14, 22, 16, 43, 530, 973, 1622, 1385, 65]
# 영어 단어를 숫자로 바꿔놓은 것
# AI는 글자를 읽을 수 없고 숫자만 읽을 수 있다.
# 그래서 텐서플로우 자체에서 단어마다 번호표를 붙여넣고, 그 번호표를 표기한 형태
print(f"라벨 예시 : {y_train[0]}")
# 라벨 예시 : 1
# 첫 번째 데이터는 긍정인 것이다.    1 = 긍정, 0 = 부정

# ========================
# 2. 데이터 전처리
# 각 데이터별 컬럼 생성
# 사과는 맛있다.
#   1      2                                                    2개 컬럼
# 우리가 먹는 사과는 굉장히 달고 맛있지만, 새콤하기도 하다.
#   1      2     3     4     5      6          7        8       8개 컬럼
# 기계뇌를 만들 때 처음에 input 자리에 몇 개의 컬럼이 존재하는지 작성할 때
# 컬럼의 개수는 ??? 가 된다. 왜냐하면 각 데이터별 컬럼 수가 가지각색이기 때문에
# 초기 로봇의 뇌를 만들 때는 리뷰 길이를 맞추어서 생성해야 했다.
# ========================
# 리뷰마다 길이가 달라서 200 으로 맞춰줌
# 만약 리뷰 길이가 200보다 짧다면 0으로 채워서 길이를 맞춤 길면 자름
최대컬럼길이=200
# pad_sequences = 길이 맞추기 기능
# sequences     = 순서가 있는 것들의 나열 의미
# pad           = 채우다
# pad_sequences = 없으면 채워서 순서가 있는 것들을 최대 개수만큼 길이 제한하여 나열 하겠다.
#         길이조절하겠다.(길이조절할 데이터, 길이 조절할 숫자 개수 범위 지정)
# 길이 조절된 데이터를 X_train X_test 라는 바구니에 다시 담아두겠다.
X_train = pad_sequences(X_train, maxlen=최대컬럼길이)
X_test = pad_sequences(X_test, maxlen=최대컬럼길이)
print(f"전처리 후 shape : {X_train.shape}") # 전처리 후 shape : (25000, 200)

# ========================
# 3. 로봇뇌 만들기
# ========================
로봇뇌 = Sequential([
    # Embedding :       숫자를 의미있는 벡터로 변환 (단어를 좌표로 표현)
    #                   단어를 숫자 좌표로 변환하는 층
    #                   수학적인 공식으로 각 숫자를 단어에 표기해놓음
    #                   단어를 의미 있는 좌표로 바꿔주는 번역기
    # dim = dimension : 차원
    # input_dim       : 200 개의 단어를
    # output_dim      : 각 32개의 차원으로 최대한 맞춰 숫자로 만들겠다.
    Embedding(input_dim=단어개수,
              output_dim=32,
              input_length=최대컬럼길이),

    # SimpleRNN : 순서를 기억하면서 읽는 핵심 레이어
    # units 기억공간 개수
    # 기억공간  8칸 (너무 작음)
    # 기억공간 32칸 (기     본)
    # 기억공간 64칸 (더 복잡한 문장 기억 가능)
    SimpleRNN(units=32),

    # Dense : 최종적으로 긍/부 정 0~1 사이 확률로 출력
    #    Dense 의 값을 2로 주거나, 1로 줄 수 있다.
    # sigmoid = 출력이 2개짜리일 때 확률을 기준으로 0 또는 1 둘 중 하나 출력
    # softmax = 출력이 3개이상일 때 1을 기준으로 각 확률을 조회하여 확률이 높은것으로 출력
    Dense(1, activation='sigmoid')
])

# ========================
# 4. 만들어진 로봇뇌를 어떻게 학습시킬지 학습 방법 설정
# ========================
로봇뇌.compile(
    optimizer='adam',
    loss='binary_crossentropy', # 긍정/부정 2가지 분류이니 binary 맞음
    metrics=['accuracy']
)

# ========================
# 5. 로봇뇌 + 학습 방법 이용해서 뇌 만들기 시작!
# ========================
학습하기 = 로봇뇌.fit(
    X_train, y_train,
    epochs=10,       # 전체 데이터를 10번 반복 학습
    batch_size=128, # 한 번 학습할 때 128개씩 분류지어 학습 진행 데이터 128개 몇 묶음씩 진행
    validation_split=0.2  # 훈련 데이터 중에서 20%는 검증용 사용
)
# ========================
# 6. 평가
# ========================
오차, 정확도 = 로봇뇌.evaluate(X_test, y_test)
print(f"테스트 정확도 : {정확도:.4f}")







